[{"authors":[{"title":"（要饭的）可怜大猫猫","url":"/authors/yfdkldmm/"}],"categories":[{"title":"末世，与兽同行","url":"/categories/%E6%9C%AB%E4%B8%96%E4%B8%8E%E5%85%BD%E5%90%8C%E8%A1%8C/"}],"content":" “影，该起来了。”\n朦胧中，听到这一个声音。很熟悉，不过一时间想不起是谁。\n“嗯，想再睡会儿。”但并不影响这个回答的适用性。\n“不能再睡了，再睡脑袋可是会疼的。”\n不过，那又怎样？睡了再说，副不副作用的，他才不管。所以，根本不去管。\n“呜，再不起，我就咬了哦。”\n咬，咬什么？算了，懒得管。\n“嗷。”突然而来的痛感，让徐孤影醒了。白影也就松了口。\n“我的手……”痛感依旧还存在着，不过不是很痛。\n“影的肉尝起来真不错。”然而某人却是这个态度。\n“那要不要我每天用我的肉喂你？”\n“呜，我错了。”听得出来，某人心里有着怒气。\n“算了。”抬起手，去撸一撸狼。\n每天醒来，旁边就有毛茸茸的东西，而且还可以互动，带来心灵的满足。不要太美好啊。\n“我睡了多久？”下意识喃喃，再伸手去摸手机。\n“半个小时了。”\n“好吧，是有点久。”对于一个正常午睡来说，“不过，接下来做什么呢？”\n就平常而言，已经找不到活动消遣时间了。现在还是末世，平常的活动大部分也都做不了。\n“影就没有必须得做的事？”\n“必须要做的？”这倒是想起个很重要的每日，不过，“嗯……还是想睡觉。”\n“那我再咬影一口好了。”说做就做，避开犬牙，咬了上去。\n“啧。”在接触到的时候下意识收回，结果，不小心就因此开了一下口子，“你牙齿还真锋利。”小心查看，发现伤口只是细的，有点长，慢慢渗着血。\n“我来舔舔吧。”同样没有迟疑，直接含住了他的手，舌头将血迹全部带走，“血也味道不错。”\n“你完全就是馋我身子吧？”都不知道该怎么说，批评不至于，但就这么放过，那也完全不行，“我怕是迟早有天要被你狠狠咬一口。”\n“呜……”白影稍显委屈地吐出手，“我不会伤害影的。”\n“那这怎么说？”徐孤影指着已经神奇般愈合的伤口，不过他习惯了这么神奇。\n“呜……”可怜，委屈，又无助，“那是个意外……”标志性的认错姿势。\n垂到一半的耳朵，低下的头。很难不原谅啊。\n“算了。”又摸了摸头，“我修炼精神力去了。”\n这可是目前对他来说，提升力量的唯一方法。他迎来了他想要的改变，他也得对得起这个改变。\n“影要去冥想了么。”\n“嗯。”\n“那我继续睡觉好了。”\n明明显显就是讨打。\n“嗷。呜……影冥想了，我也不能发出噪音啊，所以只能睡觉啊。”委屈。\n“没什么，就是想打你一下。别给我装可怜，那一下根本不疼。”落下这句话，在床上坐起来，然后摆了个舒适的姿势，就这样闭上眼睛。\n冥想，只需要一个不被打扰的环境，然后尽量保持自己舒适，同样是为了保证不被打扰，之后再按照书上说的去做就够了。\n会很枯燥，但是中间不能停下来，停下来就意味着今天的修炼到头。\n或许，这比坐在教室里上课都还要难耐。不过，要得到就得付出。他付出努力，得到想要的，没有更公平的交易了。\n一边的白影还真的就趴下，闭上眼睛，像是睡觉。\n画面就这样像是静止了三个小时。\n“啊，脖子好酸。”并不只是脖子，还包括着其他一些部位。可以简称，久坐不动综合症。\n“感觉冥想如何？影。”白影立即就说话了。\n“还行，就是一直闭着眼睛，却又睡不着的状态……感觉挺奇妙的，然后，很无聊。”\n“影可得坚持下去。”\n“那当然。”为了什么都好。\n“现在多久了？”依旧是下意识去看看手机。\n“大概五点左右。”\n“诶，还真是，五点两分。”和白影说的时间不差多少。\n白影可是直接自己就说出来了。\n“对时间的把握可是身为动物的一种能力。”白影解释了一下。\n“不过，我想要更精确的时间，到秒最好。”\n“那我再努力一下。”没有迟疑。\n“算了，你当好雷达就行了，不需要做太多事。”起身，下床，“饿了吗？”\n“不是很饿。不过，想吃肉了。”\n“不饿都想吃……你是多执着。”缓慢走向厨房。\n“肉已经不能给我提供多少能量了。晶石才是主食，肉就算是零嘴喽。”跟在后面。\n“那么零食可以不吃的，对吧？”进了厨房，看到了已经解了冻的肉。\n“呜……”后悔了，不该说出事实。\n“冒昧问句，你要吃生肉还是怎么样？”一般来说，狼肯定是吃生肉的，不过，白影是有了高级智慧的，那……生肉还合适吗？\n“影准备吃什么？”\n“嗯……”没想过，不过，这个会很好想的，“青椒肉丝吧。”\n“那我也跟着影呗。”\n“你能吃调料么……还有青椒这些。”\n“可别小瞧了我身为魔兽的消化能力啊。而且，生肉哪有炒出来的好吃。”\n“哦。”表示了解了。\n“咦，这肉已经切好了啊。”解冻后，就能看见肉已经分成条状的了。\n“因为我不会切肉，就买肉的时候让他们打成丝了。死也学不来切肉。”\n“那以后交给我好了，什么形状都给你切出来。”\n“那好啊。”正好他懒。\n回到客厅，从冰箱里拿出青椒，然后看了看白影。\n“那不如，现在就来展示一下，你的爪功？”\n有了白影的帮忙，下午饭飞速地就做好了。每次做饭慢，就是因为切菜慢，这下，完全不用担心了。\n“不吃饭吗？”才发现，貌似没有蒸饭。\n“不太想吃饭。这点就够了。”\n“吃得好少。”\n“也许吧。”不过，早就习惯了，改的话，基本改不过来吧。\n白影面前，是一个中型铁盆，看起来够一个人，甚至是一条大型犬吃上几分钟，然后……\n嘴伸进去，舌头一卷，喉咙一咽，十秒解决。剩下五秒就是进行光盘行动，完了，还用舌头舔舔嘴的周围，显得意犹未尽。\n“这……”全程就这样，呆着，看着白影，后者还去拿了纸巾，然后擦拭嘴的两边。\n“嗯？我哪里不对劲吗？”\n“没什么。”收回目光，这很符合设定，“不过，还会拿纸巾擦嘴啊。”\n“我白色的毛可不想粘上什么。”意外地很爱干净。\n接下来就是白影静静看着徐孤影享用晚餐。尽管表示出它可以帮忙解决一部分，为光盘行动做出贡献，不过结果是非常明显的。\n“啊，那么，接下来做什么？”\n满足了食欲，就该思考怎么消磨时间了。该做的事情，都做了，接着也和之前一样，找不出什么消遣活动。\n白影是给不出答案的，它的话，除了睡觉，也就没什么消遣。\n“外面貌似放晴了？”转头，透过厨房的窗户，看到一缕阳光。\n昏黄的，但是有点明亮，被防盗护栏分割的光，照射到水槽边缘，让人觉得外面现在阳光正好，甚至是会有点热。\n说人话的话，那就是出晚霞了。\n“要出去散散步嘛？”突然蹦出来的想法。\n“可以啊。”白影无所谓。\n“那就出去吧。”\n尽管下一秒就想到，貌似还是末世，街上到处是丧尸来着，不过，又想到早上处理丧尸是怎么个顺畅法之后，完全放平了心态。\n真的，这就是去散散步。甚至，还不忘带上手机，戴上蓝牙耳机。\n“蓝牙耳机的话……你怎么听？”好音乐不能独享，对方欣赏的话，很乐意和对方一起分享。\n还会很期待。\n“影就放在包里就行，或者，影戴上耳机，我也一样能听见。”\n那就放一个耳机在裤兜里好了。\n赏心悦目的音乐，温和不刺激的阳光，还有……白影。散步标配。\n“影，准备去哪？”白影问道。\n“不知道。”从来不会想这个问题，都是到了分岔路口，然后，再随着心走。\n所以，他们一出了小区，就往上坡走。\n这里同样是个人迹罕至的地方。道路建好了，房屋也盖好了，店面也弄好了，但周围并没有人住，就更别提生意了。\n所以，这里的丧尸也很少，偶尔来一两个，当作小小的饭后运动。\n“啊，这边……”再往前走了点距离，靠近了一点点城市中心，就能看到建造华丽，至少对比其他平常房屋很是华丽的建筑群，“这边有个大型超市来着，或者说，百货超市吧。”\n“那这里面的东西肯定很多吧？为什么早上不往这边走？”白影觉得自己似乎是第一次听说这里，不然，早上它会提醒徐孤影的。\n“因为这个大型超市……你也看到了，这边很偏僻，而我，大概两年多没听到这边的一些什么宣传活动了，认为早就倒闭来着。”\n“这么惨的么……”\n“别说惨不惨的，这可能只是自己作孽？”找不到好的说法形容。\n“为什么？”\n“它当时是我们这里第一个大型超市，而且刚好我们才搬迁下来，城市都还在修建完善。就之前也一直都是在建立城市设施。所以这个超市本来有大把好的位置选，它却偏偏选在这，尽管一开始火了，但那也是因为第一次出现大型超市，人们的新鲜感而已。等后面出了新的，更靠近中心的超市出来后，它的存在感就好像越来越低。”回忆了一下对这个超市的一些认知，“反正，我是不知道具体怎么回事。那也不重要了。”\n“这样啊。”白影又增加了对这城市的一些了解，“那要不要去看看？也许，还会有些什么。那边也有人活动来着。”\n“可以啊，反正散步嘛。”没有忘记初心。他们是散步来着。\n一开始还离得有点远的那层建筑，逐渐可以看清全貌。\n“影，那栋楼后面，有三个人。”白影牌雷达再次启动。\n“那栋楼？”白影指的，是一大块空地中，与其后面一排的房屋结合起来之后，像是凸字一样的那一个高楼。他一直以为那个楼就是和后面那一排连着的，结果并不是？\n“他们遭遇丧尸了。感觉起来还是两只。”\n“两只？三个人？”不能直观体会到这数字代表着什么，只是通过之前的例子来看的话，“那估计并不好解决吧？”\n“嗯。”白影突然动了动鼻子，“已经有人受伤出血了。”\n“是说的那三个人，而不是丧尸吧。”\n“嗯。要过去么？”\n稍稍想了想。“反正都无聊，过去救救人吧。”\n他们离那里已经不远了，以他们现在的速度的话，花费不了几秒。\n接近，然后进入拐角，便直接能够看到两个人。\n看身高，还有略显稚嫩的脸庞，或许是初中生或者高中生？\n总之，一人一只地，艰难地抵抗着丧尸。从他们发抖的手就知道，已经没有多少力气继续抵御，很快，或许就会变成地上随处可见的块状物，或者永远让本能驱使着身体。\n现在顺便试试传送？\n想法到实践，比想法到思考快得多。下一瞬间，匕首就已经出现在丧尸脖子周围，那么结果，也就只是让手继续带动匕首，画出一次较为圆润的新月。\n旁边的情景不需要多在意，依旧是白影扑上去结束，只是这次从侧面来了而已。\n这一切，在他俩看着，挺正常的。不过，对其他人的话，可是足足需要三秒左右的一个缓冲，哦不，是大概呆滞了五秒？\n“……谢谢。”大脑还需要处理一下刚刚看见的东西，不过那其中一个人还是下意识道了谢。\n“这就不用了，我觉得，那边可能更紧急哦~”指了指他们后面。\n他们后面有什么，他们自己也十分清楚，如梦惊醒，刚准备放松的心，继续高速跳动着。\n“你怎么样？”他们急切地去查看受伤的人。\n“我……”受伤的少年嘴唇勉强还能动一动，只是脸部扭曲着，遭受着难忍的痛苦。并不只是身体上。\n“我……”想说什么，但却总也开不了口。身体还在颤抖，双眼不敢直视就在身边的伙伴。\n“让我看看你的伤。”\n少年没法反抗，只能任由着自己的伤口暴露出来。\n“嘶~”看到伤口，那两个伙伴无不倒吸一口冷气。\n伤口很长，在右手臂上，用左手只能遮住一大半，一部分血液已经流到了指尖，并且还在缓慢流着，但是伤口的边缘，已经……\n“长晶石了……”\n他们知道这意味着什么。\n事实上，从少年受伤的时候，他们就知道了。\n“我……”已经无法掩饰了。本来也就没有可掩饰的。\n“不用管我了。杀了我更好吧……”\n这个时候，时间或许就应该静止不动，留出足够的，或许是回忆，或许是思考，也或许，只是需要发一下呆。\n“这样啊。”\n徐孤影没有跟过去，他只是就那样原地蹲下来，把手放在白影头上。不过他依旧可以知道，那边说了些什么。\n那个少年很明显，就已经处于正在被感染的阶段，要不了多久，就会变成丧尸吧。\n“该称赞他么……”为了不变成丧尸，给他的伙伴带来困扰，主动寻死，这舍己为人，抛开生死，至少就勇气而言，都值得赞扬了，“不过，我说不出来。”\n再次笑了笑，笑得很浅，笑容也消失的快。\n“白，那个净化，就是可以阻止感染的吧？”\n“嗯。影准备救他么？”\n“不然呢？”反问回去，然后起身缓慢走过去。\n那边，还处于画面近乎静止的状态，只是，徐孤影未曾掩饰的脚步声惊醒了他们。\n“啊，救命恩人。”听到了个似乎很古老的称呼。\n“你的同伴已经被感染了，对吧？”\n“……是的。”提起这个，再次陷入沉寂。\n“你想干什么？”看着徐孤影不断接近，另一个人炸毛了，“不准你杀他。”\n“不过，他已经感染了哦，难不成，你还有办法治好他？”或许，这个轻佻语气是真的招人厌吧，不过，习惯了随心，这个对他来说不是大事的事情，没必要太严肃。\n“你……”知道说的是事实，所以，更加地恼怒，但是，反驳不了。\n“让我自己走吧。”习惯了疼痛之后，伤者可以小声地流畅地说话了，但是那两个人完全不想听他说话，“你们不忍心，就让我离开这里吧。”\n“不，不行。”\n经典的生离死别现场。一般动漫里，这种情节，都是为了衬托主角或者其他什么有着高大上品质的配角。\n请原谅，他知道此刻应该很严肃，不过，就是严肃不起来。\n“行了，你们就别弄得像壮烈牺牲了，我可以治好他。”\n“什……什么？”\n“我说，把他的手给我。”估摸着他们还会呆滞一会儿，干脆自己动手了。\n“嘶~”受伤的手突然被移动一下，痛感还是很强烈的。\n“就算痛，你也得忍着。”\n丢下一句话，然后闭上眼，集中精神力，按照教学，去感受灵魂力量。他也不懂是什么意思，不过好在，教学把该怎么做说的很清楚，清楚到连灵魂力量是什么都可以不知道。正好合适。\n很快，手指尖出现亮光。是那种纯粹的，金色的光芒。\n净化的光芒引导出来了，接下来就只需要把光引导到感染部位就行。\n“啊！嘶。”伤者瞬间疼得，连冷气都没有力气吸入，那种感受，难以言说。\n不过，效果是有的。\n“诶，晶石没了，晶石没了！”\n“真的！”\n这种喜出望外的情景，不需要太多语言去描述，动漫看得多的话，完全就是已经刻在DNA上面了，闭着眼都能想出来。\n“影，感觉怎么样？”\n“感觉？”什么怎么样？“哦。感觉还好，精神力用得有点多而已，其他的，没什么消耗的。”\n“那就好。”白影只是关心着他。\n那三个人的喜悦还是没有削减。\n“虽然，我知道你们很高兴，不过，建议还是先处理一下再说，一会儿光是流血都会死哦~”\n“哦，对。”又是梦中惊醒，“不过，这没有什么可以处理的啊。而且，该怎么做？”\n怎么做？那三个少年都不知道。而这，也刚好触及到徐孤影的知识盲区。\n“影，拿纸包住他的伤口，按住，然后等我。”白影瞬间就跑不见了。\n“啊，那……”他们总算是注意到白影了，或者说，是终于有时间关注了。\n“手别收回。”提醒了一下之后，徐孤影按照白说的，从空间戒指里拿出没开口的抽纸，迅速撕开然后扯出一大把纸，将伤口完全盖住，然后用力按压。\n当然，力气不能太大，他有点分寸。\n“你们看看周围，有丧尸就赶紧提醒我。”白影走了，那么，侦查的事必须得找其他人。\n“啊，好。”尽管不太明白现在又发生了什么，不过这个紧张感还是可以体会。\n“那个……”伤者突然开口了，“谢谢。”\n“没什么。现在就希望你别死于失血过多就好。感觉如何？有没有头晕？”\n“还好。”不过，说话有些虚弱了，或许刚开始一直都是。\n时间流动得有些慢，焦急的等待中，都是如此吧。\n很快，白影回来了，嘴里叼着一个长筒样的白色布，还有小瓶的碘液。\n“你跑去药店把这些东西给拿出来了？”还真得亏白影找得到药店，还能翻出这些东西。\n“一会儿说吧，影，你先用碘液给他消毒。”白影把嘴里的东西放在地上，才发现还有几根医用棉签。\n虽然棉签这些已经存在被污染的可能，不过用碘液之后，应该不成问题，重要的是止血。\n用碘液消毒，并不是什么难事，棉签一蘸，一涂，就好了。\n“然后用绷带包扎。”\n“包扎？怎么包扎？”他之前从未接受过这类知识，连看都不曾看过。\n“螺旋反折包扎法啊。好吧，算了，影按照我说的做。”突然想起，徐孤影可能是一丁点基础都没有的。\n“用绷带在他手腕上端一点点缠几圈。”这个毫无难度，“然后往上，在手臂内侧的时候，按住绷带，再旋转绷带卷半圈，把那个翻折之后形成的折皱弄平，然后继续绕绷带，重复。”\n啊？什么？他，刚刚听到了些什么？\n“影这都不会啊……”白影第一次感觉到了无奈，“我来示范一次。”\n然后，就走了过来，一只爪子接过绷带卷，另一只爪子就处理那个折皱，不过也只是把位置标出来，弄平的话，还是得需要人的手指更简便一点。\n“这样啊，我会了。”看了一遍之后，就很清晰知道怎么弄了，缓慢，但是精准地完成着包扎。\n“最后一样是绕几圈，然后用胶带给粘好吧。”\n从空间戒指里拿出透明胶，白影帮忙固定绷带，粘好后，白影用爪子划断了绷带。\n幸好，走之前，还是往空间戒指里塞了些各种各样的东西，以备不时之需。\n“好了，尽量不要动右手，别用力。过二十分钟，就稍微松一下。”这也是白影告诉他的。\n“呃，那个……”\n“怎么了？”\n“这条狗……”\n呜噜……\n喉咙发出狠恶的警告声。当然，它也只能这么表达不满了。\n“白。”\n白影打了个响鼻，然后转过头。\n“好啦。”知道白影闹别扭了，也知道原因，摸摸头，安慰安慰，然后又对那些少年说道，“它不是狗，是狼，而且，它听得懂的。”\n“这么神奇吗？”\n听到这句话，白影眼睛瞥了一下，然后继续享受抚摸。\n“它可是懂很多的，刚刚怎么包扎都是它教我的。”\n那群人立即露出惊奇的表情。徐孤影看着，感觉心里很是舒服。\n“好了，你们注意一下这个伤，没个一周是好不了的。”起身，领着白影，准备走了。\n“诶，救命恩人。”还是这个，感觉奇奇怪怪的称呼，“你准备去哪？”\n“我？目前打算去那看看。”指了指前方，一个大型地下超市的入口。\n“去那？那不是已经关了一年多了吗？”\n“是吗？”完全不知道，作为本地人，他或许完全不合格吧，“那，我继续到处走走吧，出来散步而已。”\n“散步……？”他们的反应在意料之中，徐孤影也知道，他的想法，就现在这个情形而言，完全就是疯子的标准。\n“你们呢？是出去找食物对吧？”\n“嗯，我们的食物明天就没有了，所以必须要去找。”那三个少年基本是轮流回答着。\n“不过，你们这个样子看起来，似乎希望不太大了吧。”\n“嗯……”\n话题再次沉重起来。\n“要不，我跟着你们逛一逛？”\n“嗯？”\n逛一逛，那是不是可以换个意思，换个词，换成“我帮你们清除丧尸”？\n“放心。”轻笑，“我不需要食物，你们能拿多少就拿多少，我只不过是出来散步。”\n嗯，出来散步，顺便帮帮人吧。\n“我们……”\n“走吧，正好无聊。”没有等他们，直接往前走了，只是速度很慢。\n最后，少年们还是跟上了。\n“去哪？”\n“就在前面，那有个店子。”\n“嗯。”把还戴在耳朵上的蓝牙耳机摘了下来。虽然刚刚就把音乐暂停了，不过取下来之后会更好一点。\n他们走得很慢，因为要顾及伤员，而且，并不长的路上，丧尸并不少。\n“好厉害。”看着徐孤影轻而易举就干掉一个又一个丧尸，不禁发出感叹。\n“这是在做什么？”另一个则是对给脑袋开瓢感到迷惑。\n“挖晶石啊。”取出来，给他们看了看。\n“啊，这不会就是小说中说的，那个可以拿来修炼，还可以当货币的东西吧？”\n“谁知道呢，不过确实是有能量在里面。”一转眼，晶石没了。\n“诶，消失了。”\n“肯定是那个吧？绝对是那个！那个小说主角都有的收纳空间！”显得很是激动。\n“我不是主角。”不过，没有否认收纳空间这一点，“至少，我不是你们的主角，你们的主角只是你自己。”\n“啊？”被这么一句话给搞蒙了。\n“没什么。走吧。”率先走在前面。\n“诶，你们说。”其中一个人就刚好拉着那两个人在后面，“这是不是像极了那些主角？实力强悍，有收纳空间，还有个很灵性的宠物，能听懂人话呢。”\n“白影可不是宠物。”前面的徐孤影突然说道，“而且它还会说话呢，只不过只能和我说而已。”\n“不，影，我只是不想说话。”突然，一个声音传达到了这周围的所有人脑中。\n“谁？！”\n“是我。被你说成狗的我。”白影还是很介怀这件事。\n“啊，对不起。我看不出来。”算是很真诚地道歉了。也算是情有可原，毕竟可以说是萨摩耶。\n“哼。”撇过头，显得很不屑。\n“就这么介意被说成狗吗？”徐孤影继续摸摸头，“哦，也是，我也不太喜欢别人说你是狗。不过，你什么时候可以和别人说话的？”\n“我们签订契约之后就可以了。因为影给了我精神力，我就可以用精神力和别人说话。不过，我不想和他们说话。”\n“所以，我很不一样喽？”\n“那当然。”\n你已经是白影的唯一。\n啧，怎么又想到这个。\n“你们是朋友吗？”赶紧转移一下注意力。\n“是啊，我们三个，从小学就是了，而且一直都住得很近。”\n是么，那……\n“很不错嘛，我还从没体验过那种感觉。住得近，玩的时候肯定很方便吧？”\n“对，只需要在楼上往外一喊，他们就都听到了。”\n喊楼上的人嘛……好像初中的时候也体验过……想这些干嘛。\n“肯定基本上每一天都很开心吧，你们应该还是同一个学校的，每天都还能一起回家。”\n一起回家……\n“对啊，我们还一直一个班。”\n一个班……\n“那挺好的啊。啊，就是那前面了吧。”尽管都没怎么来这边，不过便利店长什么样，还是比较清楚的。\n最后一点也是毫无压力，三个少年得愿以偿将自己背后的背包给装满了。\n“好了，我也该走了。”\n“诶，救命恩人……”为什么要叫住他？他要走那是正常的啊，为什么下意识？\n“怎么了？”稍微想了想，“嘛，不用你们报答我什么的，我只是来散个步。”始终不忘初心。\n“……谢谢。”最后只是剩下一句道谢。\n回以一个微笑，然后告别了他们。\n“回家吧，突然，有点累了。”\n“嗯。”\n继续拿出耳机听歌，离家还有点距离。\n“影。”\n“嗯？”\n“影刚刚难过了吧？”\n“哈，没有。”\n没有吗……？至少……骗过白影吧。\n“我不一直都笑着么，怎么难过呢？”\n“但影刚刚好像心痛了，直觉。”\n走路的动作停了一下。他自己都不知道为什么停一下。\n不过算了，他想抱一抱白影。\n“影……”\n“白，你刚刚跑哪去了？”\n“就去了下面的那家药店啊。我记得周围就只有那家药店了。”\n“那一家？”徐孤影知道白影说的是哪，他买药一般都是去的那，“不过，路上还有很多丧尸吧？你怎么过去的？”\n“当然是跑啊，我跑起来，那群丧尸根本追不上我。不过，药店里也有些丧尸，当时情况有些紧，处理了之后没挖晶石就带着药过来了。”\n“没什么，也就几个晶石。”站起身，继续往回走，“不过，倒是想骑着你去兜兜风……算了，当我没说吧。”骑的话，感觉就像白影是他宠物一样。\n他不想这么定义他们的关系。\n“影想骑就骑啊，我还挺想带着影兜风的。”\n“你是不觉得骑这个字……很不对劲吗？”\n“哦，这个啊。”白影很快懂了意思，“我知道影没把我当宠物，这就够了。所以，哪天影要来试试吗？”\n“好啊。”从来都没体验过骑狼的感觉，骑马都没有过，想想都会很激动啊。\n之后，回到了家，突然感觉很累，哈欠连着打了好几个，连累着白影也是嘴合不拢。\n“这才多久，就这么想睡了……”才顶多八点吧？不知道，没看，但是比以前睡觉时间，至少提前了好几个小时啊。\n“那么，影就睡吧。”\n“还不行，我要洗澡。”\n“好吧。”\n“你给我阳台待着去，没等我上床，不准进来。”他必须注意一下自己的隐私。\n“好吧。”只能默默听话，然后留下一堆血印子。\n啧，把这个给忘了。\n“你也得再次洗个澡……好难，好想睡觉。”\n“那一会儿我自己洗澡吧。”再看看地面，“哦，顺便帮影把地也拖了吧。”\n“那不错啊。洗澡去了。”\n很快，卫生间里就传出水声。\n这次因为很困，所以洗了个头就出来了，然后继续什么也不穿，打开风扇，用被子把自己裹好。虽说总感觉这个打开风扇又裹好被子的行为很是多此一举，不过，为了隐私，以及睡眠习惯，没办法。\n“一会儿你可以和我睡，但，是！”语气突然很强烈，“你不准！掀我！！被子！！！”\n","date":"2023年5月7日","img":"","lang":"zh-hans","langName":"简体中文","largeImg":"","permalink":"/docs/%E6%9C%AB%E4%B8%96%E4%B8%8E%E5%85%BD%E5%90%8C%E8%A1%8C/%E7%AC%AC%E4%B8%83%E7%AB%A0/","series":[{"title":"小说","url":"/series/%E5%B0%8F%E8%AF%B4/"}],"smallImg":"","tags":[{"title":"兽人","url":"/tags/%E5%85%BD%E4%BA%BA/"}],"timestamp":1683458187,"title":"第七章"},{"authors":[{"title":"（要饭的）可怜大猫猫","url":"/authors/yfdkldmm/"}],"categories":[{"title":"末世，与兽同行","url":"/categories/%E6%9C%AB%E4%B8%96%E4%B8%8E%E5%85%BD%E5%90%8C%E8%A1%8C/"}],"content":" 打开家门，先进屋换鞋，然后白影从门缝里进来。\n“emmm……”徐孤影盯着地面。\n“怎么了？”白影回过头看了看，然后顺着目光……\n“啊，我……对不起。”\n地面被污染了，由于白影的爪子。\n“算了，没什么，本来这个地也很久没打扫过了。不过就这样也不行。”徐孤影想着解决办法。\n“那，影给我洗澡？”\n“洗澡？”他从没想过这点，“不过我在之前看网上说的都是几天洗一次最好，如果都洗澡的话……”\n“放心吧，影，那是对动物，忘了我是什么了吗？”\n“好吧。”\n径直走到卫生间，然后很是熟练地打开淋浴，等到又是熟悉的热水器的声音，才突然觉得不太对劲。\n“诶，水电气都没停啊，在小区门口那也是……”\n末世是这样的吗？本以为，这些都应该没了。那么，网络？\n放下喷头，立即回到房间，抓起都过去这么久都没管过的手机。\n“好吧，网络是没了。”\n略带着一点遗憾回到卫生间。\n“这个水温，如何？”先是自己试了下，然后对着白影一小块身子冲了几下，等待白影的回复。\n“有点点烫。”\n“现在？”转动了一下开关。\n“好了。”\n既然水温合适了，那么徐孤影也可以正式给白影洗个澡。也没什么好洗的，主要就是爪子上的那点污渍，其他的，白色皮毛还是显得如此干净。\n“瞬间感觉你小了好一圈啊。”大概就是，体宽三四分米左右，全身打湿后，只有一两分米。\n“我又不胖，我只是毛多，毛沾了水，都这样啊。”确实，那些毛长的，就算平时颜值再怎么高，一洗澡就原形毕露。\n除了对爪子进行必要的搓洗外，白影的身子的其他部位，徐孤影也是一一进行了简单揉搓，感觉嘛，就是真的觉得白影的身体似乎很是匀称，即使不是美术生，也能感受到流线的美。\n“诶，摸肚子也很舒服么？”当然，还有意外发现。\n“嗯……影……”来源于本能的一种舒服，就像被摸头一样。\n“下次继续，得快点洗完，别感冒了。”\n“当然不会啊，魔兽哪有感冒的。”\n不过，澡还是很快洗完了。\n“我看看，拿什么给你擦擦……”然而，卫生间挂着的，只是一个毛巾，还是用了很久的，这完全不好意思拿去用啊……\n“不用，影躲开就好。”\n“你该不会……”没有犹豫，赶紧离开。\n随后，水滴被甩得到处都是，幸好徐孤影跑得快。\n白影出来时，身上基本已经全干了。\n“这比洗衣机脱水还效率……”摸摸已经干了的毛，又体验到了那种蓬松，柔顺的感觉。\n“这可是下雨天必备技能。”\n笑了笑，轻轻环上白影的脖子，耳朵贴耳朵地，感受着有节奏的起伏。白影忍不住，挣脱出来，然后，舔了一口。\n“呃，有点疼。”摸了摸被舔的部分，嗯，也没摸到大量的口水，这就好，“中午吃什么？”刚刚顺便看了看时间。\n“肉！”这个答案，谁都心知肚明，其实，徐孤影也只是想问自己而已。\n“吃肉的话，要么你就吃点那些火腿肠，要么……”起身，打开冰箱冷冻室，然后拿出冻结的肉，“你就只有等下午了。”\n“那就下午吧。我还不饿。”\n“好吧。”拿着肉，去厨房放水解冻。\n“那我中午吃什么……”这个事情真得想想，因为，很少有过答案。\n“影貌似除了读书期间，饮食都完全不规律，还经常不吃呢。”\n“这你都记得住啊。”\n“那当然啊，我记忆力很好的，这几个月和影的一点一滴我都记得，包括影每次洗澡……”\n“停停停，你是想被扒皮了是不？”\n“呜……只是想说，影很多时候洗澡都要花很多时间而已。”它肯定不想被扒皮，它完全记住了那次警告。\n“洗澡花的时间都很久？”呃……造成这个的原因……每个男性都……“这个……洗澡的时候很舒服嘛。”对，只是很舒服，那种感受到温暖的舒服。\n绝对正经。\n“好吧。影想好吃什么了吗？”\n“没有。”\n“没有想吃的？”\n“有？不知道。我已经很久没有特别想吃什么了。就算是上学，那也是随便保证身体还过得去的情况下随便吃点。正好也是吃外面的，不用做饭。我懒。”\n“这样的么……那不喜欢吃什么？”\n“不喜欢？”突然感觉，这又是一个大问题。\n曾经，记那些知识都不费力的他，似乎从来就没记住过这些。\n“苦瓜不喜欢，然后……想不起来了。”\n“呜，真是麻烦啊。”\n“嗯，我还是个选择困难症晚期。”坐到了沙发上，总不能，站着聊天吧？\n“不，影其实是没有在意过自己的生活吧。”\n“在意生活……”\n他没有吗？\n……他……有吗？\n“不知道……”\n他不想知道，不想……他只是……只是想着……\n“影！”\n“啊，怎么了？白。”\n“刚刚你的呼吸很乱，是……回忆到伤心的事了？”白影从沙发上跳了下去。刚刚它跳上来，准备一有什么不对劲，就采取措施的。\n“没什么，白，到沙发上吧。”然后继续着刚刚的，“回忆么，我没什么伤心事，我也没回忆。”\n“那……好吧。”白影停下了这个话题，“还是继续说吃什么吧。”\n“嗯。”\n白影想了想。“既然影不知道吃什么，那，要不我来每天给影说吃什么？”\n“随便啊，不过，一些东西我坚决不吃。”这是底线。\n“那当然，到时候，影给我说就好了。本来，我可以直接给影做好饭的，不过，现在只能这样了。”有点小遗憾。\n“等等，做饭？”\n“对啊，我变成人了，不就可以做饭了吗？”\n“等等。”信息量有点大，“你还可以变成人？”\n“呜，我都说了几遍了，我是魔兽诶，魔兽变成人，小说里还少么。”\n“但那也是小说……”\n“末世不是小说情节？还有，我也不应该是属于小说情节？”\n“好吧。”他本就不应该惊讶。\n“哼哼。”突然，白影骄傲起来，“而且，我还是可以变成只保留耳朵和尾巴的兽人，或者，干脆就是furry兽人哦~影更喜欢哪一种？”\n“呃……”总感觉，白影是故意这样说的。\n噢，对，肯定是这样。\n“你居然还看了我看的那些图？！”这完完全全，属于社会性死亡啊！那些图……\n“影的电脑壁纸都是狼诶，还是那种雪狼，而且，明显是个furry迷嘛。当然，某些图的话……”\n“给我闭嘴！”天哪，他感觉，他在白影面前完全没隐私……这也怪他，完全没想到会有这一天，“你再敢提，你知道的！”\n“呜，又要扒皮……”怕了怕了。\n不过，偶尔捉弄一下，很开心啊。影真害羞，嘿嘿。\n“继续说午饭吧。今天中午时间也不早了，影就不如吃点方便面？”\n“也行。”说起这个，“哦，对，带回来的东西还没处理。”看了看客厅四周，“放在哪好呢？阳台小，都放不下。”\n“那就，那个房间？”白影指的是，徐孤影的房间对门，“貌似从来没用过。”\n难得的，没有立即收到回应。\n“……那个房间嘛……”缓慢下了沙发，走过去。\n“怎么了？影。又想起伤心事了？”\n“呵，我都说了。”摇摇头，笑了笑，“我没有伤心事。”\n在那扇门面前，手放在了把手上，却迟迟按不下去。\n白影不敢继续开口了，它不敢打扰，而且目前，徐孤影看起来，状态还算不错。\n啪沓。\n门开了。首先入鼻的，就是一股难言的味道，吓得白影立即后退。\n“嗯~原来那味道都来自这。”\n“啊，抱歉了。这个房间，废弃了很久了，我一直没打算清理过。”\n房间里也很暗，窗帘关得死死的，几乎透不进一丝光。打开灯，让一张大的床，两个床头柜，旁边的衣柜显露出样子。\n先是去拉开窗帘，打开窗户，让房间透透气。\n“这里面，发霉都这么严重了啊……”\n房间还保持着原来的模样，大概吧，忽略掉物品一些程度的腐烂的话。\n“影。”白影走了进来，忍着强烈不适。\n“不需要勉强的。”\n“这个房间都多久没打扫了啊，这甚至是完全就没通过气的样子。”\n“啊，这个问题的话……三年了吧……”\n“三年？！”实在难以想象，住在同一座房下，居然会有一个房间放了三年，这还不是地下室啊。\n“这房间原来是谁的？”藉由，白影突然大概猜到了答案，“影的父母呢？”\n“我父母？”怔了一下，“我父母在我七岁就离婚了，我跟了我妈，这个房间也就是她的。”\n“那为什么房间空了三年？”\n“很简单啊。”很轻松地，还笑了笑，“因为没人住了呗。”\n“那……”直觉突然告诉白影，最好，不要继续下去，“现在怎么收拾？不收拾的话，也不适合拿来放东西吧？”\n“这倒是。”不过，就算有了理由去收拾，“但我基本……不会啊。”\n“不就是简单收拾一下嘛？这都不会啊。”\n“……因为……”\n因为什么，他说不出来。\n“算了。待在我身边，影。”\n没想什么，就这样站在旁边不动。\n瞬间，白影的爪子，起了亮光，还带有哔哩哔哩的电流流动声响。\n“这……”他能清晰看到，电流顺着地面，传达到房间的任何地方。\n时间很短，转眼就没了。\n“这是……魔法吗？”\n“影，我都说了……”\n“停，我知道，你是魔兽。只是，一直都没用魔法，我就以为你不会了。”\n“因为那群东西都不值得我用，用一次就要耗费好多的能量，我这还只是小小地随便控制了电流，处理一下那些发霉的情况，就耗了一小半的能量。好饿，我想要晶石，两个。”\n这个要求肯定没问题。\n“能量储备这么少？”\n“嗯，我还只是很低级的那种魔兽，还需要成长。”\n“这样啊……”再看看房间，那些微生物都已经不见了。\n真是快捷的房间清理。\n既然这样，那就可以好好地把战略品放出来了，一下子，就占满了一大半左右的空间，这是包括高度的那种。\n“哇，有点壮观。”他之前从来没见过这么个体积的物品堆放。\n“这样乱糟糟的，真的好么？”\n物品是一股脑丢出来的，食物以及一些日用都没进行分类，更别说各类的更细一点的分类。\n“是不好，但是……”看着庞大的数量，怎么都不会想着整理吧。\n“影懒，对吧？”\n“哈哈哈……”尴尬的笑容。\n“呜，没办法。影去吃饭吧，我来收拾。”\n“诶，这……你能收拾得了么。”而且让白影来做的话，他心里过意不去。\n“没问题的。影都照顾了我那么久，现在该我照顾影了。去吧去吧，没事的。”\n“那……好吧。”\n都这样了，他只能拿着泡面退出去，然后烧水泡面。不时地，看到白影后腿直立，两只爪子抱着箱子进进出出。\n真不知道它怎么做到的。\n趁着泡面间隙，徐孤影开始去探索今早上，关于那些东西的内容。他得好好看看了。\n先查看的，就是那本书。书的内容已经完全印在脑海中，一个字都不差。\n要是当初背书都这样……背不背书已经无所谓了。\n“当你读到这段文字的时候，说明你已经与白影签订了契约。”书的开篇，就是这段话。\n看起来，是完全为他准备的书……\n“由于我与其他一些存在有着契约，不能透露太多，白影也是。不要试图探究我们的过去，你把那些当作不存在就好。也许白影会和你说说那边的事，当作故事就行。你不需要有压力，相信我，相信你自己，你已经是白影的唯一，任何方面都是，相信它吧，它不会伤害你，而我，至少也会因为这点，给予你最多的帮助。”\n需要缓一缓。感觉，刚刚接受了一大堆的信息，但现在完全看不懂。正好水开了。\n“我相信，有白影的帮助，你在末世不会受到生存危机。所以，你可以过你想过的生活。但是，你也得同样承担起一些责任，第一就是照顾好白影，第二……我不能透露，你就当作是你必须得变强。你应该也明白，末世，力量至上，我想我不需要多讲。”\n肯定不需要。水倒进去了。\n“我给你的，就是一套精神修炼，你只需要每天保持三个小时冥想，除此之外，也就是空间魔法。我相信你在空间魔法上会很有造诣。很抱歉，我没法给予你更多的金手指。不过，那些存在给了你一个神术。具体的，你自己去看吧。”\n这段话结束后，这类似于前言的部分，也彻底结束了。\n“神术……”首先是对这个特别好奇，而他，也很快翻到了，“清除一切混沌带来的效果。”\n混沌？那是什么？\n“白。”第一反应。\n“嗯？什么事？”\n“混沌带来的效果是什么？”\n白影停了一下。\n“这个啊，影就当作是可以治疗那些被丧尸抓伤的人，避免变成丧尸。”\n“这……样么。”说是神术，结果真就是神术。\n白影继续收拾了，他也继续查看着。\n“目前，我能用的魔法也就传送了。”其他的，都是精神力不够，而且传送，也使用不了多少次，还得看传送距离。\n不过，为什么没有吟唱咒语？不需要的？\n这样想着，也为了试验一下，然后突然出现在前面的一张瑜伽垫上。\n“影使用魔法了？”\n“你怎么知道？”\n“因为我感觉到我的魔兽晶核被使用了啊。”\n“啊？”能想到的，就是他用魔法，然后使用了白影的魔兽晶核，这什么？\n“我们有契约啊，可以共享一些能力，所以影用魔法的时候可以用我的晶核发动，完全省去吟唱。魔兽都不需要吟唱的。”\n这什么原理？算了，探究肯定没结果。\n“会不会对你……”\n“不会的，影。空间魔法不需要能量，它只是需要影的精神力。”\n“这样啊……”没有影响就好，“总感觉，这个契约一直都是你在给我东西，力量，速度，还包括略去吟唱。”\n“影也在给我啊，比如精神力。”\n“哈。”这听起来，完全就像是安慰他。\n探索先到此为止，泡面好了。\n一时间，屋子里静悄悄的，白影整理的时候，基本都发不出声响。\n静得可怕。所以，或许需要点其他声音。\n“介意我放点音乐吗？”\n“影想听就好啊，肯定又是小提琴电子曲吧？”\n这还是完全没说错，最近就是迷上了这类。\n“诶，你居然还知道电子曲是什么意思？”\n“这有什么？”\n“你们那应该是魔法世界吧？不应该是中世纪？”一般设定都是这样。\n“据说原来是这样的。”\n“据说？”\n“嗯，因为那已经成为历史了啊。我们历史上，是来自一个叫莫比大陆的世界，那个背景就是影想的，处于中世纪。不过后来，因为莫比大陆的六位神与混沌的抗争，导致最后莫比大陆和影这个世界的一个平行世界进行了融合。简单点，影可以认为那个世界其实就是现在的科技加上魔法，然后一同发展了几十年的样子。”\n“那不就是相当于，你来自未来喽？”更简单。\n“呃……可以这么说吧。”\n“真没想到，那个世界这么奇妙。”随后，悠长的一个音符开启了音乐之旅。\n就算没网，下载好了，还需要网？\n“那，白，你觉得这类音乐如何呢？好不好听？”突然有些忐忑。\n“好听啊，怎么了？”\n“没什么，好听就好。总算是遇见一个认为好听的人了。”心中很是宽慰。\n“这个就算不喜欢，也不会说不好听吧？”\n“那不一定。”他想起了之前的一些经历，“知道紫色激情吗？”\n“那个戴安娜演奏的？”\n“没想到你会知道啊。”\n“那当然啊，这属于经典之一。这首怎么了？”\n“哈，也没什么，就是我在班上放过一次，然后被说成是举行葬礼。”这个说实话，他当时完完全全想不到。\n“葬礼？！”白影也对这个情况完全惊讶了。\n“是哦，而且全班都这么认为的，还……说我放的什么鬼音乐之类的。”说起来，都还能体验到当时的窘迫，还有那种，你满怀欣喜与别人分享，却落得冷言冷语的落魄。那是他最后一次。\n“那群人……就该让他们葬礼的时候请华尔兹舞者去给他们表演一下，不是说像葬礼吗？那满足他们好了。不用管那些人，不懂欣赏就算了。”白影很是气愤，都想去给他们点颜色。\n“早就不在乎了，相处两年半了吧，班上的人，我并不熟。”\n“没有朋友吗？”\n“嗯。自从初中分别之后，我一直是一个人，同学也不过是熟悉的陌生人。”\n“不会……寂寞吗？”\n“寂寞？呵。”还是标志性的轻笑，“一开始是难以适从，不过，习惯是很可怕的。”\n“影不想有人陪吗？”\n“怎么可能啊……不过，谁愿意呢？”至少，同班的，没有一个人。\n“我啊，影，我会一直在影的身边的。”\n你已经是白影的唯一……\n再次轻笑了一下。然后配合着节奏的律动和如同女孩清脆歌声一样的小提琴音，清空一下大脑。\n刚好是最喜欢的潮汐大师。也是带领他进入这个领域的林赛小姐姐创作的曲子。\n“都想学小提琴了。”并不只是因为这悠扬的琴音。\n“那就学啊。”\n“我可没有小提琴。”\n“现在就直接去找小提琴，末世嘛。”\n“但我并不知道哪里会有，这个城市里，没有一个地方卖得有小提琴的，最多的是吉他，然后是古筝。”也许，这也是没人会欣赏的一个原因吧。\n“这个事情交给我好了，我会给影找到的。”白影保证道。\n“那……我拭目以待？”其实，没有抱太大期望。\n进行到这里，泡的两桶泡面已经吃完了。是的，刚刚早就换成了精神交流。\n“啊，想睡个午觉……”吃饱了，就想睡，而且，今天也感觉很累。\n“我这边也弄完了。”\n“这么快？”起身去看看，然后看到摆放非常整齐的布局，“真快。”忍不住去摸摸头，正好，可以当做一种夸奖。\n“我也有点累了。”白影打了个哈欠。然后众所周知，打哈欠是会传染的。\n“哈啊~那我们去睡觉吧。”\n“好。”白影自然地走向原来睡觉的地方，在那停住。\n“呃……”徐孤影也注意到了问题，白影一瞬间长得太大了，“那，我们一起睡床？”\n“好啊。”精神瞬间来了，尾巴快速摇摆着。似乎这是尾巴甩得最快的一次。\n“你睡里面吧。”打开风扇，躺在床边缘上，得给白影留出位置。\n“可以再过来点，影。”\n“我怕我压着你。”\n“这有什么的，一会儿影一个翻身就还下去了，我一样被吵醒。”\n想想，狼的听力确实是如此？\n“好吧。”那就再过去点。\n已经可以闻到白影的味道了，即便是他不太好用的鼻子，感觉，有点安心。\n“睡吧，影。”\n然后，闭上眼睛，真的睡着了。\n","date":"2023年5月7日","img":"","lang":"zh-hans","langName":"简体中文","largeImg":"","permalink":"/docs/%E6%9C%AB%E4%B8%96%E4%B8%8E%E5%85%BD%E5%90%8C%E8%A1%8C/%E7%AC%AC%E5%85%AD%E7%AB%A0/","series":[{"title":"小说","url":"/series/%E5%B0%8F%E8%AF%B4/"}],"smallImg":"","tags":[{"title":"兽人","url":"/tags/%E5%85%BD%E4%BA%BA/"}],"timestamp":1683458178,"title":"第六章 休息，探索"},{"authors":[{"title":"（要饭的）可怜大猫猫","url":"/authors/yfdkldmm/"}],"categories":[{"title":"末世，与兽同行","url":"/categories/%E6%9C%AB%E4%B8%96%E4%B8%8E%E5%85%BD%E5%90%8C%E8%A1%8C/"}],"content":" 他们下一个目的地并不远，以位移来算的话，顶多三百米，还很大可能多算了一点距离。\n这个大街上，没有几个丧尸，甚至可以说，没有丧尸。因为这里属于县城的边际，突发变异时，也不会有多少人就在这街上溜达。\n“影，小心，这个小区里，还有着十几个活人。”在接近菜市场的时候，白影提醒道，“而且，有两个人正在和我们一样接近菜市场。”\n“这你就能知道了啊……”突然感觉，这白影堪比那什么……雷达，对，雷达，哦，不，甚至比雷达还好使？\n“那当然，我是狼啊，两公里内的气味我都能闻到。”白影又骄傲了，但它确实有着骄傲的资本。\n“你确定你这不是开挂？”两公里，那是什么概念？绝对不存在被偷袭了啊，而且，还基本上掌控两公里内的生物活动路线……想想都可怕，而且，想想都觉得太爽了。\n“什么叫开挂？这可是身为狼最基本的感知，哼，影是嫉妒了。”白影还突然傲娇了起来？\n“嫉妒？我需要吗？难道，有危险接近了，你还会不告诉我吗？”\n“那肯定不会，影的安全是第一位，不管什么，我都会保护影的。”\n“你也是。”徐孤影轻笑，“你的安全也是第一位，别忘了我们的契约。我也不想你受伤。”停下步，又撸了一下狼才继续走。\n真是越来越感觉离不开那种触感了。\n菜市场就在小区内，贴近于这条街。\n“感觉丧尸比我们那要少许多。”或者说，主要道路已经没有丧尸更贴切一点。这样也说明，这里确实是有活人，而且，有能力干掉丧尸。\n“他们离我们有多远？”快到菜市场门口了，但是周围没有发现人。\n“并不远，再过几十秒，我们就能看见他们了。他们被一个丧尸给缠住了。”\n“这样嘛……”没有去想帮助那些人。一嘛，肯定得先找食物，二就是，徐孤影觉得，两个人打一个丧尸总该没问题，毕竟他都可以秒杀，就算实力有差，也不会差太远吧。\n思考间，他们来到了菜市场门口。\n“有些店子的门已经被破坏了啊……”\n入眼的，就是一些展台，然后两边分布着门面，徐孤影所熟知的几个干鲜店的门面已经被破坏，还有几个肉贩子的仓库也无能幸免。\n“这看起来……并没有什么东西留着了啊。”\n进入到里面，基本全是空箱子，也就还剩下一点东西，不过，徐孤影并不想要带走这些，这让他看起来就像个强盗。虽说不是不可以当几次。\n“影，他们来了。”\n收到白影的提醒，徐孤影出来一看，远远的有两个人影在接近，不过由于近视，不太看得清模样，但也不重要，他只需要能够看清，来者不善就行了。\n“你是谁！”来的其中一个人很快就跑过来了，手上拿着那种肉贩用来割肉的长一点的刀，具体叫什么，徐孤影并不知道，“你准备抢东西？”\n“不不不，我没这个打算，你看。”徐孤影展现出自己空空的双手，而且也尽量让语气温和。\n“那你赶紧给我离开！”直接开口轰人，随后，另一个人也到了，同样是拿着这种刀，狠狠盯着徐孤影。\n“行。”本就是打算离开，也不在意对方那个语气，毕竟这是末世，物资高于一切。\n“你准备干什么？”\n“离开啊，你们让我走的。”\n虽说是这样，但是徐孤影的路线和那两个人想的不太一样。\n为什么离开还要朝我们这边走？\n“你走这边要干什么？”一刻都不能松懈 甚至想到对方是准备偷袭。\n“我要去上边的便利店看看啊，这里没有食物，我总不能饿……”\n“停！”突然这么吼了一个字。\n这让徐孤影有些无奈，他不想起冲突，只能再次站住。\n“你说你要去那上边的便利店？”\n“对啊。”\n“你知不知道那上面的样子？”\n“不知道。”\n“那就说得通了。”那个人算是搞明白了，也稍稍放松了，还给出了警告，“我劝你别去，那上面，丧尸特别密集。”\n“哦，谢谢。”徐孤影还是道了声谢，“那我可以走了吧？”\n“可以。”\n得到准许后，徐孤影继续抬步向前，这出乎了那个人的意料。\n“你干什么？你要去送死？”\n“送不送死，谁知道呢，我反正是需要食物。”没有停下，径直走向菜市场门口。\n那两个人一直和他保持着安全距离，一直盯着，以至于，过了会儿才发现白影的存在，毕竟菜市场里面，展台和略微黑暗的环境可以作为一种遮掩。\n“这是什么？”\n“哦，它啊……”怎么回答好呢？“一只狼吧。”\n“骗谁呢？”这大概就是说谎话的最高境界了吧，说真话没人信，“你居然还有闲心带着你的狗出来，而且还没死。”\n说话真的不好听，白影不是一次对徐孤影说让它上去教训教训这两个人。\n“别在意，我不想把时间浪费在这些上面，忍忍吧。”徐孤影同样在精神上回复。\n“既然影都这么说了，算他们运气好。”\n忍住了冲上去的想法，白影乖乖跟在徐孤影后面。\n“诶，等等。”当徐孤影和白影已经走出菜市场，并准备往上走的时候，之前那个人再次叫住了他们，“要不要，我和我弟一起陪你们上去？”\n“哈？”徐孤影没有预料到这个情况，刚准备不经过思考就说话的时候，白影让他收住了话，“我考虑一下。”\n“你是说，他们就是准备让我当工具人？”\n“工具人？那是什么？”\n“呃，没什么。总之，就是他们想和我一起去，然后我出主要力气来清理丧尸，如果到时候我受伤了，他们直接就跑，如果成功清理了，他们就可以不花费太大力气和风险就能得到新的食物据点。”\n“嗯，是那个弟弟建议的。”狼的听力，肯定是轻而易举就听得见。\n“这样啊。”徐孤影心中已经有了答案。\n“那，随便你们吧。”徐孤影对那两个人说道。他并不在乎这些小心思，毕竟，终究是末世。只要不触及他的底线的话，他不在乎。\n“不过，白，一会儿你别出手。”既然都打着这个算盘，那不留好一张底牌，可是会吃大亏的。徐孤影并不想拿自己的安全当作赌注。\n“好。”那两个人很高兴，快速走过来，然后突然想到，“你好像连武器都没有……”他们是不是……脑子有点生锈了？\n“谁说的？”徐孤影右手从后面拿出了未出鞘的匕首。当然，这是掩饰。\n“那好吧，我们走吧。”那两个人率先走在前面，当然，这也只是因为前面一点距离没有丧尸。\n其实只要眼睛不瞎，出了菜市场，就能看见上面不远处徘徊着大量的丧尸，比之前楼下那一段要密集一点。\n所以很快，那两个人走在了徐孤影的后面。\n“一会儿我们怎么杀那些丧尸？”那个当哥的问道，“是一只一只引诱？”\n“不用那么麻烦，直接上就可以了。”\n“可是……”已经不止一刻，那两个人觉得徐孤影脑子有问题了。\n但那又如何呢？有实力不就是可以做出让别人觉得脑子有问题的事？\n就好比现在，徐孤影已经冲上去斩掉一只，而那两个人却想着要跑。当徐孤影准备进攻第二只的时候，那两个人才反应过来。第二个脑袋掉下来后，那两个人才觉得是捡到宝了。\n这还是他刻意放慢了一点速度。\n由于四个活物的闯入，周边的丧尸都开始围过来，尽管那俩兄弟靠得比较后，但依旧是有着不少的丧尸盯上他们。\n他们顶多可以轻松应付一个，两个丧尸的话，就不能保证不会受伤，而两天内已经见过不少的血的教训告诉他们，受伤就等于完了。\n徐孤影这边肯定没有问题，虽说没了白影，显得有些乏力，但是至少，经历了两次战斗，躲避不成问题，还能顺带帮帮那两个人。\n丧尸不是一涌而上，刚好有些契合他们的节奏，在有点轻松的情况下，不知不觉就差不多清理完了。\n“你这是干什么？”当哥的问蹲在地上，还在划开丧尸脑袋的徐孤影。\n“挖晶石啊。”将那个晶石展示给他们看。\n他们似乎立即明白了什么，也都迅速蹲地上，学着给丧尸脑袋开瓢。\n“就这样让他们拿？”白影问道，“他们至多才自己杀了七个丧尸，剩下都是影的诶。”本就对那些人不满。\n“给他们点又如何？再说，他们也不一定有我的速度快。”\n徐孤影基本上几秒钟就能挖出一个晶石，但那两个人，武器并不给力，敲开一个被强化了硬度之后的头骨，都得花点时间和力气。在他们攻击丧尸的时候，徐孤影就发现了。\n“诶，哥。”那个当弟的，停下了动作，去他哥旁边，小声地说，“你看见没？那个匕首，特别锋利。”\n“是挺锋利的。怎么，你是想说……”\n“对，抢过来。”弟弟很轻松说出这几个字。\n“可是，他都帮我们这么多，我们……”\n“诶，哥，你要想想，我们抢过来了，那我们不就是战斗力直接上一层楼嘛？他砍那些丧尸如切西瓜一样，不就是靠着那个匕首？”\n“可是……”当哥的还是被道德给牵制着。\n“还有什么可是的？昨天你干掉那些受伤的，也没见你手软，现在怎么就矫情起来？”\n“……那条狗怎么办？”\n“还能怎么办？到时候，趁那小子不注意，你去偷袭，我就去杀那条狗。我可是有了速度异能的，绝对比狗快，而哥你，力量异能，一刀砍掉那小子半个手绝对没问题。”\n“……我再想想。”\n“还想什么？机会可就这一次。现在出手都可以。”\n“……让我想想。”\n“啧，你考虑清楚吧。”弟弟走开了，装作一直都在处理头骨。\n他们自以为隐藏得很好，因为，徐孤影不曾转过一次身。\n“是这样嘛……好吧，白，我知道了。”计划，已经被徐孤影全部知道了，“就看，他们动不动手吧，不过，别杀他们，我还不想。”如果，不动手，就更好了。\n收集晶石花不了多久，徐孤影用非常快的速度做完了这件事，那两个人也因此没有并没有收集到几个。但他们不在意，反正，也许过不了多久，那些也属于他们了。\n“便利店已经到了，我们进去吧，各人凭本事拿食物，怎么样？”徐孤影提议道。\n“啊，行。”当哥的似乎有点心不在焉。\n没有停留，徐孤影带着白影直接走上前，将后背完全留给后面那两个人。\n时间仿佛过得很慢，动作也很慢。\n“哥。”弟弟想表达什么意思，不言而喻。\n此时，对他们来说，确实是最好的机会，而且，还会不会有机会，完全不知道。\n“哥！”明显变得急切了。\n那两个人没有剩下太多时间，前面的目标，已经接近了便利店门口，而他们，也在步伐上，逐渐地拉长距离。\n再犹豫的话，真的没有机会了。\n武器……帮助……喂。\n当哥的还在犹豫，但是当弟的不打算继续等下去。他哥做不了决定，那就让他来做，他相信，他哥不会放着不管的。\n是的，他哥在反应过来之后，已经放弃了思考，放弃了纠结，抬起刀就冲了上去。\n最终，还是变成这样。也许，早就注定了。\n“啊，死畜生！”当哥的的意识还停留在他冲刺的时候，但是下一秒手臂和后背传来的痛感已经告诉他发生了什么。\n更别说，白影正压着他，居高临下地蔑视着他，裂开的嘴，露出来锋利的犬牙，喉咙里不断发出威胁的低吼，一只染血的爪子正抵着他的喉咙，随时都可以了结他脆弱的生命。\n他不敢反抗，也不能。一只手被爪子划伤，另一只手被咬了一口，刀也掉在一旁。\n“诶，别乱动。”徐孤影轻声说着。他是在那个弟弟耳边说的，左手已经把对方的右手给翻折在背后，由于背上还有着背包，右手呈现出一种比较诡异的弯折，死死抓住这只手，接着右手捏紧着对方的拳头举到对方的右脖子边，而那捏紧的拳头 正握着那把匕首。\n“你不是很想要这匕首么，现在，你拿走它啊。”\n被禁锢着，丝毫都不得动弹，对方巨大的力量超出了他的想象，用尽全力，也不见对方有任何吃力的现象，手都不抖的。\n“都说了别动，我经不住吓的，手可能就会抖一下，发生什么，我可不知道。啊，对，我这还是涂了剧毒的匕首，当然，我不会舔。”\n“我……我……饶了……”他开始怕了，他不该招惹这个瘟神，他为什么之前完全没发现有这么强？不过不管怎样，他现在只想活着。\n“这就求饶？没劲。”\n掰开那个拳头，收回自己的匕首，然后用力把对方给推出去，导致还没缓过神的那个人还摔了一跤。\n“白，过来吧。”也让白影放过了那个还在流血的可怜人。\n“按照约定，你们依旧可以拿走食物，而且不需要顾忌。”\n尽管这么说，可是那两个人还是不太敢动。毕竟一个人受了伤，而且……他们真的还有资格吗？\n“再不拿，你们可就没机会了。可以当我不存在，只要你们不骚扰我，就不会有事。”徐孤影一直以这个标准行事的。\n“走吧，哥，赶紧拿了东西离开吧，你的伤口也需要快点处理。”\n“……好吧。”\n他们承认，很后悔，本该事情不会如此，但他们，只能够继续下去。\n徐孤影让那两个人先进去拿走物资，他和白影就在外面。他并不急，他也不认为，就两个大点的登山包能够搬空一个便利店，何况，这个便利店还是保留着原来的样子。\n“白，这些血……”蹲下身，仔细看着白影的爪子。之前一直忙着找食物，并没有注意这些细节。\n“没什么，影，都不是我的。”任由徐孤影托起它的爪子，“来的路上还是有很多血迹，然后挖晶石也难免碰到。”\n“那，刚刚那个人受伤程度怎样？”\n“影关心这个干嘛？”\n“就随便问问。”\n“好吧。我刚刚已经很留手了，只是划了三四厘米的口子，然后给他手臂上留了个牙印。我都没有把他的肉给撕下来。其实很想给他咬断一只手的，或者，干脆……”\n“好了，白，不用说了。”他已经知道白影想说什么，“也许，算我懦弱吧，但我觉得他们还是罪不至此，给一点教训就够了。”\n“……影。”\n“嗯？”\n“你并不懦弱，只是善良而已。”\n“……或许吧。”\n这个话题，双方不约而同结束了。\n那两个兄弟很快装满了背包出来了，最后还是道了声谢，迅速离开。\n“去看看我们能收获些什么吧。”\n进入便利店后，眼前的货物架基本还是满的，也就只是那些高热量，能够填饱肚子的食品少了许多。\n先一边吃着点东西，一边同样选择那些重要食品给丢进空间戒指，然后明显还有着空间，再依次选择其他食物，然而，即使把店面都搬空了，还是有空间。\n“这个空间戒指得有多大的容量啊？”本来，以为就是个大一点点的保险柜，结果，这都快变成一个小仓库了吧？\n“影没有去感受过吗？用精神力。”\n“没有，完全没想过，而且我们出来得急，也没时间。”不过，总之，还能继续装东西就对了，“这会不会有那种仓库放着库存的？”\n“在这。”一个较为隐蔽的位置，反正徐孤影没看到。\n仓库里面是一堆纸箱子，一一打开看了看里面的物品，继续往空间戒指里塞，依旧是全部弄进去了。\n出来，看着完全空荡荡的便利店，心中莫名产生了一丝悲凉的感觉。\n为什么？不知道。\n“还是留点吃的在这里吧，今天的收获，或许都够大半个月的了。”又从戒指里倒出一些，那些人急需的食物。\n“走吧，白，今天就到这吧。”\n回去的时候，走的是另一条路，略微看过，路上丧尸不算太多，就当顺便清理了。\n“啊，那里……”\n左边的视野里突然出现一座建筑物，有着明显的学校特征。这让徐孤影略微停了一下。\n“怎么了？影。”很快，白影也看到了，“那是影的学校吗？”\n“不是。那是个职高，而我是普高。”\n“哦。”\n“不过，我初中的朋友却在这里读书来着。”\n“朋友？那，影不去找他们吗？我可以载着影去。”\n“不用了。”收回视线，继续面对前方的丧尸，“那都是初中时候的了，高中分开后，就渐渐没了联系，现在，我连他们的大概位置都不知道。”干掉几个丧尸之后，“那里面还有活人吗？”\n“还有，而且数量在一百多。”\n“是嘛……”便不再关心，他不想花太多精力。他不在乎那些人。\n没有什么停留，回到了家。\n","date":"2023年5月3日","img":"","lang":"zh-hans","langName":"简体中文","largeImg":"","permalink":"/docs/%E6%9C%AB%E4%B8%96%E4%B8%8E%E5%85%BD%E5%90%8C%E8%A1%8C/%E7%AC%AC%E4%BA%94%E7%AB%A0/","series":[{"title":"小说","url":"/series/%E5%B0%8F%E8%AF%B4/"}],"smallImg":"","tags":[{"title":"兽人","url":"/tags/%E5%85%BD%E4%BA%BA/"}],"timestamp":1683080852,"title":"第五章 同类"},{"authors":[{"title":"（要饭的）可怜大猫猫","url":"/authors/yfdkldmm/"}],"categories":[{"title":"末世，与兽同行","url":"/categories/%E6%9C%AB%E4%B8%96%E4%B8%8E%E5%85%BD%E5%90%8C%E8%A1%8C/"}],"content":" 穿上鞋，打开门，那种腐烂的气味便扑鼻而来。\n“楼道上面也都这么惨烈么……”\n尽管没有多少的残缺零件，不过液体还是遍布地面。\n如此直观地……体验了这种冲击……\n“呃……”肚子不自觉难受起来，呼吸略微加快，吸入更多的，带着说不清气味的空气，越发地，加重了不适。\n“影，很难受吗？”白影立即关切道。然后想做些什么，用后腿站立起来，一只前爪环住徐孤影的脖子，另一只爪子放在了他的背上。\n由于身体的缘故，白影这个动作很是别扭。\n“没事，让我自己缓缓就行了，我可是，一直期待这种画面，期待着亲身体验，可不能……呃，咳，嘶~”深呼吸了一下，“就这么撑不住了。”现在，差不多恢复状态了。\n“一直期待这个场面？”白影见没事了，又蹲了下来。\n“算是吧，我也曾想过，我杀人的场景。”可以很平淡地说出这句话了，甚至，还带着毫不在意。\n“……嗯。”它不知道，怎么回答。\n它的回应，在徐孤影看来，属于着另一种信息。他轻笑一下，也蹲下身，主动抱住了白影。\n“我不是见人就杀，我只是……”\n只是什么？我……该怎么说？算了。\n“白，我不会伤害你。”\n大概停了一秒。\n“嗯，影，我也不会伤害你。我会保护你的。”主动摇晃头，去蹭。\n再次轻笑一下，放开了白影，转过身，开始下楼。\n控制着脚步声，顺畅无阻到了楼底，只是还没出这层建筑。\n“离近点看……意外地还算体面啊。”\n这指那些丧尸，身上没有多少血肉模糊的地方，只是布满了晶石，然后行动看起来有些呆滞。\n观察不出什么，干脆继续向外走。刚一踏出半点建筑，对面就有一只丧尸转过身冲了过来。\n嘶，还有点惊悚，不过还算行，呼，但是，为什么，这丧尸的动作看起来有点慢？而且，包括我的动作？\n“影，往左闪。”\n即便眼睛看到的已经算是慢动作了，但是，从未体验过，甚至已经很久没打过架的他，大脑已经对这方面的敏感度下降许多，依靠着白影的提醒，他才真正开始有效移动。\n左脚不动，右脚和身子迅速旋转，在丧尸开始扑击，但是还离他较远的时候，就已经规避了这次扑击。\n“然后用匕首直接把它的头砍下来。”\n用不着白影提醒，徐孤影就已经有了攻击倾向，\n匕首早已出鞘，在慢动作下，准确地避开那双爪子的同时，身体大幅左旋，右手反握着匕首，让刀柄贴近自己左边脖子，刀刃横放，然后借助身体旋转的力量带动右手，再控制住手肘弯曲程度，让刀刃，直接，划过丧尸高抬的右手，脖子，以及剩下的左手。\n啪嗒，啪啪。\n丧尸的身体倒在地上，零件分割的地方，开始淌着血。\n第一次战斗，结束了。\n“呼，呼，呼~”徐孤影喘着气。但绝对不是因为累。\n“影好厉害。”白影夸奖道。\n“哈，这算，厉害吗？如果不是你的话，我可能，没法反应。”\n“不会的，只是会反应慢一点而已。而且影直接就进入战斗状态了，然后那一刀也是真的很厉害。”\n“哈，谢谢。”被说得，都不好意思了，然后，也逐渐从那种心理亢奋的情况平复下来。\n“这把匕首，还真是锋利。”他砍的时候，没有丝毫阻力，地上的无头尸，切痕也平滑得在证明。\n只不过……\n“呃，那个头……看起来还是觉得有点……”\n“难受吗？”\n“嗯，不过没什么，第一次而已，见多了，就习惯了。”说话的期间，那种感觉也在逐渐消退。\n“那就好了啊，丧尸只能砍头，而且，这个头里面，也是有非常重要的东西。”\n“什么东西？”\n周边的丧尸仿佛完全无法察觉这边的事，徐孤影和白影得以有着时间来探索这个头颅。\n“看。”白影利索地，用爪子直接刺入丧尸大脑，然后扒开，将脑内结构完全呈现出来。这又让徐孤影恶心了一下。\n“呃，咳，这……是个晶石？”\n“嗯，它们就靠这个行动，所以切断了脑袋，这个晶石断掉了大部分的神经，连着其他神经一起失去活性。”\n“怎么突然感觉在学生物？白，你居然还懂这些？”\n“因为以前有学过，刚好这种案例并不少。”\n“是嘛……”他，敏锐地，察觉到了一些事情。\n“然后，这个晶石，里面也蕴含着能量。”白影继续讲着，“这丧尸的，可以让任何修炼人员吸收，提升身体或者精神力。”\n“这不就是相当于魔兽晶核呗，只不过通用而已。”直接换了个更通俗易懂的说法，对他来说通俗易懂，“那，我也可以靠这个来提升精神力吧。”\n“不行，影很特殊，只能用那个方法来提升精神力。”\n“啧，那我拿这个不是没什么用么。”好失望。\n“不啊，这个很有用的，而且最好越多越好。”\n“你是说，用这个去交换？”\n“当然不是。”白影用两只爪子拖起那枚晶石，“肯定是这样啦。”然后往自己嘴里丢，晶石直接消失在白影口中。\n“呃……你……原来是魔兽啊。”\n“什么叫原来？本来就是嘛，那种普通动物，可能和我懂的一样多么？”\n“抱歉，一直没往那方面想……”赶紧转移话题吧，“难怪你总说保护我啊，原来是真有这能力，而且，也许比我强多了吧。”\n“那自然。”白影很是骄傲，头都不自禁抬高了点，“所以，影，你不用担心，你绝对是安全的，有我在。”\n这段话，让徐孤影又轻笑了一次，忍不住再次去撸头，不过很快就放开了，因为他们还有着大事要做。\n“看起来，我们或许得杀出去。”再看了看道路，基本每隔四五米就有一个丧尸。\n“那就杀出去，我很快就可以把这些给解决掉。”连姿势，都已经准备好了，随时可以扑杀猎物。\n“那，一人一半？”\n“好！”话音刚落下，白影已经缩短了它与猎物一半的距离，当它扑出去的时候，那群丧尸才有了一点点的反应。\n结果并不需要多说，白影用爪子刨出晶石后，直接冲向下一个猎物。\n另一边尽管没有白影如此迅捷，但至少，徐孤影可以直接冲上去，在那群丧尸划伤他之前，切下脑袋，然后，直奔下一个，没有停留。\n只是大概半分钟都还不到，这楼下的小段路就已经完全安全了。\n按照之前白影的动作，徐孤影用匕首剐开，从里面取出晶石，拿在手上。那上面没有残留一点血液，像是很光滑。\n“这些晶石，你还要吃吗？”\n“不，这些影你得存着，我一天吃一个就好了。”白影含着晶石过来了，由于有点小，一次可以含两个，“那边还有。”\n“嗯。”往回走，一一把那些晶石全都放进空间戒指。\n对了，说起来，这个空间戒指似乎容量有点大来着。都没仔细看过……不过，没看过的还多了去了，就包括那本书上的内容也没怎么看……回去再说。\n“我觉得，这小区门口的便利店，应该还会有存货吧。”匕首再次划过一个挡路的脖子。\n“那个店子看起来有点小啊，如果幸存者多一点的话，早就搬空了吧。”爪子再次深入椭圆一样的物体。\n“诶？你还记得长大之前的事？”动作略微停顿了，不过依旧没有压力。\n“那当然啊，我可还记得影每次洗完澡出来，不穿衣服摸我的头再去睡觉的，而且每次在家放假的时候，影也不喜欢穿衣服来着。”顺着口就说出来了，当白影觉得不对劲的时候……\n“你……”徐孤影的动作已经完全停下来了，甚至不管旁边的丧尸，任由它们接近，反而是深呼吸几下，不断地酝酿词汇。\n他得想想，好好想想怎么接下去。\n“呃……影……我……嘿嘿，我们都是公的嘛，所以有什么好害羞的，对吧？”立即回来，将徐孤影身边的丧尸全部解决，“而且你不是天天都看我不穿衣服的样子嘛，所以……”尽力解释，尽力掩饰，再尽力转移，然而都没用。\n“滚！”徐孤影怒吼道。它不说也就只是尴尬，越说越是羞愤，“那能一样吗？！”\n“嗷……”表现出足够的歉意，还有失落，“对不起……”\n“不准再提！”当初怎么就完全想不到这个情况？好丢人啊！完完全全就是超级社会性永久粉身碎骨式死亡啊！“再提，皮都给你扒了！”但是狠话绝对不能忘，来掩饰内心的尴尬和害羞。\n“嗯……对不起……”话都不敢大声说，而且就算刚好解决完这一波，也不敢抬头，默默地去把晶石叼过来。头一直低着，耳朵也稍稍垂下。如果可以的话，耳朵也许都完全耷拉下来了。\n“哼。”收好晶石，去摸了摸白影的头，“这次就原谅你。”\n“嗯。”瞬间来了精神，尾巴轻轻甩了甩，耳朵也重新直立起来。\n随后，他们在收获了几十颗晶石之后，终于到了小区门口。不过，他们的位置一开始就离小区门口不远来着。\n“嗯，看起来，是基本没有食物了。”\n店内乱糟糟的，很明显是经过洗劫，甚至还有战斗，旁边倒落的，碎裂的货物架，地上的液体，已经可以说清这里曾发生过什么。\n“不过，他们也是没有全部拿完。”\n走进去，从地上捡起一包一块钱就能买到的香肠，忽略掉上面沾染的血迹，撕开包装，一口咬了一大半。\n突然感觉好饿，是刚刚没吃饱的缘故么。\n一边嚼着，一边继续探索着。\n“好黑……有灯么？”这样想着。\n“有。”白影过去将灯给打开了。\n“哈？”完全没预料到白影会回复 “呃，传递过去了么……”这是他第一次用精神交流。\n好像，很容易就可以把消息传过去……那我之前的那些……别，我不想社会性死亡……不过应该没有，最好没有。\n一包根本不够，反而吃了之后感觉更饿，继续从地上拿起那些未被损坏的食品，脏不脏都无所谓了。\n“哦，对。”吃第二包的时候，突然想到了什么，“白，你要来一包么？”\n“要。”\n捡起另外一包，撕开，然后想了想，取出肉肠，向白影丢去。\n白影一口接住，然后没了。\n“还要么？”\n“不了，我们回去再吃。”\n“好吧。”\n接下来就是像捡垃圾一样，把地上的一些还能食用的都收进空间戒指，顺便自己吃一点，然后架子上零散着剩下的，也都不放过。\n“这些……米？”唯一没有带走的食物，也就米和那些挂面这种不能即食的东西了吧。\n既然有电，那不如，带点走。\n“好了，白，我们走吧。”\n便利店已经没有多余的东西了，就算有，那也不急着带走，最重要的，还是需要寻找更多的食物。\n“前面不远就是一个小菜市，东西应该还剩下比较多吧。”\n他们已经晚了别人两天，能够从这个小县城里获取到的资源，也许不多了。\n第一次感觉，生存似乎有点困难了。\n","date":"2023年5月3日","img":"","lang":"zh-hans","langName":"简体中文","largeImg":"","permalink":"/docs/%E6%9C%AB%E4%B8%96%E4%B8%8E%E5%85%BD%E5%90%8C%E8%A1%8C/%E7%AC%AC%E5%9B%9B%E7%AB%A0/","series":[{"title":"小说","url":"/series/%E5%B0%8F%E8%AF%B4/"}],"smallImg":"","tags":[{"title":"兽人","url":"/tags/%E5%85%BD%E4%BA%BA/"}],"timestamp":1683080847,"title":"第四章 食物"},{"authors":[{"title":"（要饭的）可怜大猫猫","url":"/authors/yfdkldmm/"}],"categories":[{"title":"末世，与兽同行","url":"/categories/%E6%9C%AB%E4%B8%96%E4%B8%8E%E5%85%BD%E5%90%8C%E8%A1%8C/"}],"content":" 感觉就像好好睡了一觉，什么都没发生，什么都没变。不过那也只是刚睁开眼时的不清醒的感知而已。\n“嗷。”\n刚一起身，身体就像不受控制一样，大幅向前弯曲，甚至到头和大腿来了次重重的亲密接触。手又用力，辅助身体往后仰，结果直接让自己砸到床上。\n什么情况？\n他不敢再擅自动作，全身放松，开始小心探究。\n像是，力气突然变得很大。\n这个很容易确认，捏一捏拳就可以轻易感知到，就是捏得有点痛。\n啪嗒。\n这是门锁开启的声音。完全没等他反应，连大脑运转的机会都不给，门就开了。\n白色的，大只的，带着明显狼的特征的生物蹲坐在门口。毫无疑问，就是它开的门。\n“主人，你醒了啊。”那个家伙的声音传了过来。甜甜的，藏着一点磁性，比较像青春期的青年嗓音。\n什么？\n足足僵了好几秒，他们就那样对视着，然后某人突然反应过来，迅速去抓只盖住腰部以下的被子，让它重新覆盖到整个身子。\n他一直是从不穿衣服睡觉来着。\n趁着这个时间，那个突然多出来的……算是宠物？反正它来到了床边，再次蹲坐下。\n毛茸茸的，稍长的尖耳小幅度转动着，右耳又突然抖一下。\n啊，好想撸，撸秃毛的那种。\n不过，他需要冷静。\n“你……是谁？”刚开口，突然感觉到喉咙难以运作。\n“我是白影啊。主人，旁边有水。”\n白……影？可……它不只是一只小……狗……现在应该叫小狼崽了吧。不过，是为什么，它现在已经长大了？\n疑惑着，拿过旁边随便放了张矮凳子当作床头柜的上面放着的一个马克杯，将里面的水一饮而下。\n冰的？\n“还要一杯吗？”白影问道。\n“不用了。”经过水滋润过的喉咙，已经可以适应一般的讲话，只是还有点干渴而已，相比起其他事，很是微不足道，“你是白影？那个小狼崽？”\n“对啊。”一边回答着，一边继续动着不安分的耳朵。\n“可为什么……我睡了多久？”\n可别是几年吧……\n“两天。”\n“只是两天么。”心中算是放松了，“那为什么你突然变这么大？”会说话都不细究了。\n“因为主人和我签订了共生契约啊。”\n“共生契约？”他想起了那场梦。\n“嗯，因为共生契约，所以我就变这么大了。”\n所以，这就是白影对吧？所以，他可以……\n魔爪立即盖在白影头上，然后感受到了从未体验过的舒爽。\n太软了，而且这耳朵……好舒服。\n被撸着头，白影也是一脸享受的样子，喉咙不禁发出咕噜咕噜的振动。\n虽然并不想离开这充满绒毛的身体。\n“共生契约的内容是什么？”收回了手，认真地问道。\n“签订的双方共享一部分能力，并且可以在精神上对话，然后就是，共享生命。”白影像是早就预料会有这一个问题一样。\n共享能力……所以包括力量么……精神对话就是白影可以和我对话的理由吧，难怪嘴都没动。然后，共享生命……\n“也就是，我死，你也死，你死，我也死？”\n“嗯。”\n得到答案后，他不说话了。白影也不敢说话，动也不敢动。\n安静的时间有些长了。作为狼，它应该耐性很好的，而它，也可以为了猎物等上很久很久。但是这一步，它，没法等下去了。\n“主人。”白影稍稍低下了头，小心地，缓慢地，尽可能让每一颗字都十分清晰地传递过去，“要，解除契约吗？”\n嗯？\n“为什么要解除契约？”\n“因为，共享生命那一条，我不是给主人拖后腿了吗？”\n“哈……这能拖什么后腿？”\n“不会吗？”\n“会吗？”\n之后，又沉默了一段时间。他不知道该说什么，白影也不知道。最后还是，他继续撸狼了。\n“除开生命共享的话，不就是完全有益吗？我现在睡个觉力量就大增了，还可以听你说话，还能比这更好吗？有收获就有付出，世界向来都是等价交换。这已经很好了。”\n“嗯。”白影安心了下来，继续享受着抚摸。\n撸猫撸狗都会上瘾的，所以，撸狼也是如此。他承认，他已经放不开白影了，像以前一样，甚至更甚。\n“你来自哪？哪个世界？”突然，他问道。\n太突然了，白影全身僵了一下，接着，又低下头。\n“对不起，主人，我……我不能说……因为，个别……个别原因……”\n然后，他也想到了梦里的话。\n“没什么，随便一问。”又过了两秒，他想起个事，“以后别叫我主人，我从没把你当宠物。”\n“那叫什么？”\n叫什么？从来没想过啊。\n下意识看向房间角落随意堆放的那些书和本子。一般不会写上名字的，但翻翻，还是会有。不过，他认为，他不再适合，或者，配得上那个名字吧。\n“那边有什么东西吗？”目光停留的时间长了，白影也好奇地看过去。\n“不，什么都没有。”确实是如此，所以，白影又转回来了。\n“叫我影吧。”突然，这么说道。\n“影？”\n“嗯，就这样吧。”并不知道，是出于什么心理，“我干脆也就叫你白好了。”\n“嗯。”白影似乎很高兴，尾巴在小幅度重复画着圆，“那，影的全名呢？”\n“全名……”如果可以的话，他不想提到全名，不过，当作一个象征吧，象征着改变，“徐孤影。”\n“嗯，我记住了，影。”看起来像是更加开心，尾巴甩的速度很明显增加了。\n这……是狼么……\n不过不管怎样，他该起床了，因为肚子已经恢复了食欲，现在，很是饥饿，还没晕倒就算是魔法世界的不能理解的一个原理吧。\n“白，你先出去，把门带上。”\n“嗯。”\n乖乖出去，带上门，然后十几秒过去，徐孤影就穿好了衣服从里面出来了。\n“好饿……”喃喃道，然后他似乎记得家里还有之前留下的包装食品来着。\n对了。\n“白，你饿了吗？”\n“有点。”\n“那……”看了看之前专门为白影准备的饭碗，里面还留着一半的狗粮，“吃点罐头？狗粮应该不会想吃吧……”\n“不想，我想吃肉。如果可以的话，我更想吃熟的。”\n“熟的？该不会是做成了菜的那种类型吧……”\n“嗯。”白影给予肯定。生肉不是不可以，但是允许的话，谁不希望标准可以高一点？\n“哈……”第一次见，不过因为是白影的话，那也不奇怪了，“那就晚上试试吧，早上就罐头凑合一下？”此时，他已经撕开了一个包装袋，准备简单解决早餐问题。\n白影还是要了一罐罐头，不过分量显得完全不足，它刚开始享用几秒，就没了。\n“还要吗？”\n“不用了，影，还得储存物资。”\n储存物资？哦，貌似，现在是末世来着……我是不是过得太轻松了？\n几乎没有影响到徐孤影早晨的正常生活，也没什么动静来不断提醒着他，差点实实在在地认为今天只是白影变了而已。\n“现在外面是什么情况？”\n“周围没有活人了，大部分都变成了丧尸。”\n“所以外面现在是一堆丧尸围着么。”一边撕开第二个包装袋，把里面的食物放在口中，一边进入房间，然后拉开窗帘，从窗台上往下俯视。\n天，被黑云笼罩着，这让已经接近秋分的天显得有些冷，也同样，让下面的景色也倍显……苍凉？\n抱歉，他真感觉不到惨烈。不也就多了好十几个丧尸在街上游荡，然后，周边散布着黑红交替的块状物或者球形物，参杂着一点白色的东西，和近乎占据了画布一大半的红黑染料，一起组成了一副略带冲击感的画么。\n不过，口中的食物，是有点难以下咽了。\n太干了，而且也没味来着……\n“那场雨都没洗净血液么……”那两天的经过，徐孤影没法想象出来，不过知道结果就好了，“所以我们得先干掉这些丧尸？”\n“嗯。”白影也进来了，就在徐孤影旁边，和他一起往外看，“不过不用担心，影，这种丧尸我可以单挑一群。”\n“这么厉害？”送上门的狼不撸，成何体统？“不过还是小心点吧，我们现在连这些丧尸最基础的底细都不知道。而且我连……哦，对，是有个武器来着。”都快把戒指给忘了，才醒不久，脑子还不清醒。\n戒指里还有其他的一些杂物，就干脆一股脑全弄出来看一遍吧。\n意念一动，床上瞬间被占满了。\n奇怪，为什么这么熟悉空间戒指？操作是戴上就会的吗？\n“啊，这本书……”白影用爪子直接扒拉过来一本书，这本书也就是徐孤影在梦境里看过一点的书。\n“你认识吗？”徐孤影拿起那本书，像之前一样翻开，但是……\n“这些字……为什么我看不懂了？”\n书上呈现的是从未见过的文字，任何较为熟知的，都对不上，但总不可能是小语种吧？所以……\n“这些是斯塔诺亚语，那个世界的，影当然看不懂啊。”\n所以那为什么我在梦境里能认识？\n“那我怎么学？英语学到高三才勉强看得懂那些文章，这我还要重头开始？”\n“影，翻到第四百四十四页吧。”白影说道。\n“奇怪的数字。怎么不来666？”嘴上吐槽着，手的动作也没停。\n翻到那一页，依旧是一大篇看不懂的斯塔诺亚语。\n“然后呢？”\n“手按上去，按在书中央。”\n徐孤影照做了，然后，白影也伸出它的爪子，按在徐孤影的手上。\n书上立即出现一个魔法阵，停留了几秒，然后和着书一起消失。\n“嘶。”剧烈的精神疼痛袭击了徐孤影，不过很短暂。\n“没事吧？”白影有点担忧地问。\n“没，没什么，还好。”过了几秒，就已经恢复了，“原来书是这么用的……嗯，增加精神力，空间魔法，还有，净化？”脑中突然多出许多知识，毫无疑问，是那本书上的。\n“还是之后再说，再看看其他的。”最占地方的，就是几套衣服，都是黑色，加上华丽的装饰，而且，带着明显的中世纪风格。\n这些暂时都不重要，一一抛开，然后，找到了那个东西，一个有着精美刀鞘的匕首。\n“你认识吗？”徐孤影问道，\n“嗯，算是吧。”\n“算？”\n“因为……这把匕首……是个神器，而且它只属于那个神的，而那个神……嗯，没什么了，影，当我没说吧，对不起。”\n“嗯，没事。用不着道歉。”摸摸白影的头，然后注意力又放在匕首上，将其出鞘。\n“小心一点，影。”白影提醒道，“这个刀刃有腐蚀诅咒，然后还有些……许多其他的东西，不被它承认的话，就会……总之，很危险。”\n“怎么听起来这么诡异啊，拿来阴人肯定不错。”嘴角露出一丝笑容，徐孤影感觉，这个武器真的太不错了，“不用担心，我能感觉，我和它有契约。”\n所以，可以好好地端详了。\n整个匕首通体都是黑色的，连同刀鞘。刀刃的形状比较普通，但是以他微弱的精神力，都能够感觉到上面有着浓厚的魔法气息，甚至隐约，还在刃上流动。\n“这也是中世纪风格么……而且，属于暗黑生物？”\n刀格上，先是一个大的十字架作为基底，并且周边还有着银色光泽，而在其十字交叉上，骷颅头就那样镶嵌在上面，甚至空洞的眼睛里，貌似还闪烁着红光。\n“有这个，加上增强的身体素质，外面的丧尸，应该没问题吧。”\n“当然没问题，影，我自己都可以解决掉那些。”白影有些躁动一样，看起来很期待能够活动筋骨一样。\n“你很想战斗？”\n“呜……不算吧，就是，很想活动。”\n“啊，也是，好像这两天你都守着我，很难受吧？”\n“不难受，守着影是应该的。”\n“好了。”嘴角再次露出比较明显的弯曲，拍拍白影的头，“我们赶紧出去，带点东西回来，至少要保证三天内的食物来源。”下了床，收好其他东西，拿着收回鞘中的匕首，往门口走去。\n","date":"2023年5月3日","img":"","lang":"zh-hans","langName":"简体中文","largeImg":"","permalink":"/docs/%E6%9C%AB%E4%B8%96%E4%B8%8E%E5%85%BD%E5%90%8C%E8%A1%8C/%E7%AC%AC%E4%B8%89%E7%AB%A0/","series":[{"title":"小说","url":"/series/%E5%B0%8F%E8%AF%B4/"}],"smallImg":"","tags":[{"title":"兽人","url":"/tags/%E5%85%BD%E4%BA%BA/"}],"timestamp":1683080842,"title":"第三章 白与影"},{"authors":[{"title":"（要饭的）可怜大猫猫","url":"/authors/yfdkldmm/"}],"categories":[{"title":"末世，与兽同行","url":"/categories/%E6%9C%AB%E4%B8%96%E4%B8%8E%E5%85%BD%E5%90%8C%E8%A1%8C/"}],"content":" “刺眼的阳光……”\n有意识的时候，周围，又是那个熟悉得不能再熟悉的场景。\n希彼尔森林。\n“又是这里……”\n够了吧？这个鬼梦，还想要循环多少次？\n有些生气地吐了口气。等等，吐了口气……\n茫然地伸出双手，他的双手，也随着他的心意。\n“我能动了……”\n发现这个以后，也突然觉得，周围似乎，很是陌生。\n“这是……亲身体验希彼尔森林么……”\n从以往，只能以旁观者身份看着那不知名的人重复一遍又一遍的动作，变成现在，解锁了视角以后，真实还原了触感以后的真实场景。\n“穿越了？”这可能是唯一的一个解释了……\n既来之，则安之，搞不清状况，那就想办法搞清吧。\n他顺着记忆里的路走下去，不出意外的话，前方会有片小空地，然后……\n“白影……”\n不知觉中，加快了脚步，但是很快，停了下来。\n他已经可以看到那片空地，但是，没有白影，而是，怪异的桌子，怪异的椅子，以及，怪异的人。\n“你来了。”平淡，肯定的话语。但为什么还会有熟悉的感觉？\n“你……是谁？”\n“我？我不重要。来这边坐吧，专门为你准备的。”\n眉头一皱。对方说话的句子长了一点之后，才发现，自己从未学过对方使用的语言，但却了解意思。\n明显，不会想清这个问题。所以没有犹豫，没有间断，走过去，坐在了唯一剩下的椅子上。\n“很果断。不怕有陷阱？”\n“那又如何？我不过来的话，会就此结束？”清晰可见的道理，对方明显冲着他来的。\n“是我多虑了，我早该想到，你应该不会变的。”\n“什么意思？你认识我？”\n“你这句话和，问你自己认不认识你自己一样。”\n眉头再一次皱了，迅速分析这句话。他感觉，没有任何一次阅读理解比这一次还要认真。\n“你是想说，你是内心的我？”\n对方迟疑了一下。\n“或许吧。”\n十分模糊的答案，甚至是那种答题绝对零分的答案。但是，接受了那个临时设定的话，那其实很好理解了。\n自己，总该了解内心的自己吧。\n“那，这里依旧是梦境？”\n“可以算是，在这里，相对好发挥一点。”\n“发挥什么？”\n“别急，在此之前，还有些话要说。”\n“哦。”显得，似乎毫不在意。\n对方也没开口。根据现有情报分析，这是在组织语言。\n“还记得，进来之前，发生的最后一件事吗？”突然开口。\n“最后一件事？”在梦里回想现实的事确实挺荒谬的，但还能会有比现在更荒谬的？“和白影散步，突然有人叫我回去，然后下起了大雨，顺便脑子还特别昏沉。噢，那看来，就是你叫我回去的？”\n“嗯，因为，那场雨，你必须得躲开。”\n“为什么？”\n“那是代表侵蚀的雨。”\n“哈？酸雨？”以现代科技来讲，就是这个。\n“你觉得我可能会讲科学吗？”\n“我也不希望你讲科学。”\n“那就乖乖听着。”对方顿了顿，“前几天，应该有出现什么异常情况吧？对全世界来讲。”\n“嗯，出现了那种晶石生长者，就是……”\n“好了，这就够了。”打断了话语，“原谅我，我们的时间不算太多。那场雨，对于晶石生长者来说，就是属于一种变异的诱导剂，变异成什么，你可以直接参考末世丧尸。什么原理，我想你也不想去深究。”\n“所以，换句话说，那场雨，就是我现实世界变成末世背景的起点？”\n“可以这么说。所以，你想要的改变，就已经发生了。”\n阳光，依旧是那么刺眼，没有一点风，树叶也是因此一动不动吧，显得，此时十分安静，连呼吸声也没有。\n“哦。”半天过去了，他只有这一个字，而且很小声，近乎不曾说过。\n“我想，你并没有完全理解这个处境，对吧。”\n“毕竟我还在这个梦境里面，我能体会到什么？就算你给我说，我醒来之后，外面世界完全变了，但我没看一看，就没法感受。”\n“而且你也不会对那些改变有什么感触，对你而言，不过是换个方式生活而已。你还会期待，想要改变来得彻底一点，不过究其根本，你是想要，对你有利的改变。”\n“so？说这些有什么用？不过是纯粹浪费时间，还不如让我早点去体验那残酷的世界。如果对我来说是真的残酷的话。”\n“你现在出去，那就对你来说是残酷的，没有力量的人，你认为你可以怎么活？”\n“末世世界还没有特异能力的？”\n“当然有，这是来自另一个世界的影响，输入了……你应该不会感兴趣。不过总之，对你来说，你不会有特异能力。”\n“哦。”内心的一颗小火苗被熄灭了，然后面对即将到来的现实，他需要好好计划，好好思考，怎么活下去。\n“真是够现实的。就不会想，有另外的途径变强？”\n“如果有，那就是有，如果没有，那不就是空想？为什么要把精力花在虚无缥缈的事情上？”\n“那现在就谈正事吧。我们，做个交易。”\n“交易？我可不想把身体交给你，除此之外，我也没什么可以给你的。”\n“不需要你交出什么东西，相反，你得接受许多东西，这就是交易内容。”\n“接受你的灵魂？”\n“能不能不要随便就扯上夺舍？”\n“那不然还能怎么样？莫非，是一些见不得光的，或者带有诅咒之类的东西。”\n难得的，对方被说得来哑口无言。\n“这个性格有时候还真可以气死人，没想到会有这么一天……听着，你所接受的东西，对你没有任何害处。副作用有，但远比你现在受益的，小得多。”\n“那先说来听听，我可以考虑。”\n“不需要考虑，你会接受的。你会得到一枚空间戒指，里面包含着你变强所需的所有基础物品，以及其他一些东西。”\n“我怎么相信你能给我？”\n“喏，就在这，戒指你可以自己检查。”桌上突然出现一枚外观华丽，色泽偏暗的戒指，“提示一下，戴在手上才能查看里面的东西。”\n迟疑了两秒，还是拿过戒指。大小不差分毫，直接卡在了中指后端。\n里面真实存在着一些东西，最直观的就是一本书和一把匕首。\n“这本书……就是来自魔法世界的精神修炼法？”\n“简单易懂，对吧。对你来说，你只需要这一本书就够了，还有些东西，没法用戒指传递给你，不过当你醒了，你会获得所有。”\n“初步看起来，这个交易很不错。嗯？”想要将戒指取下来，但是戒指就像生了根，不动分毫。\n“戒指已经属于你了，与你的灵魂已经绑定。”\n“哈？所以，我是被骗了。”\n“不能算骗，只是为了节省时间。这还有两个契约，你签了吧。”\n“什么？”\n“戒指已经属于你了，所以对于我们的交易来说，你已经接受了交易，其中，交易除接受戒指外，还含有接受签订两份契约的命令，只不过，我把命令算作其他东西而已。”\n“……我输得很彻底。”\n“你没有输，这不过是节省时间。而且，我们没有利益交换，这些是你应得的。好了，赶紧签完赶紧回去，梦境已经开始崩塌了。”\n受交易的影响，两份契约迅速签署完毕，而后契约书立即消失不见，连内容都没办法看到任何一点。\n周边的世界还在逐步消失中，不过，看起来还是有点时间。\n“对了，有个私人请求。放心，与交易无关。照顾好白影。”\n“白影？你就是捡到白影的那个人？你是谁？你绝对不是心中的我。”\n“这个重要吗？马上就会消失了，身份还重要吗？而且，这个答案不应该由我告诉你。你会知道的，但不会是现在，也不是往后的一点时间。不要深究，只是徒增烦恼。”\n再然后，彻底没声了。\n世界的崩塌还在继续着，他感觉，当变回虚无的时候，就是他醒来之际。\n对了，那个人……长什么样来着？\n眨眼的功夫，已经彻底忘记对方的长相，甚至包括动作，衣着。他只记得自己的，以及在脑中，模拟出来的，他说着对方的话时的样子。\n没有再多的时间思考了，刺眼的阳光，已经被虚无替代。\n可以闭眼了。\n……\n外面的雨，连续下了两天，所有带着晶石的人，全都变成了丧尸。\n对于外界来讲，这两天，是他们永远不想回忆的时间。\n两天，可以发生的事太多太多了。\n从最初的惊慌，再到恐惧，最后是麻木。\n不知道是什么，让他们适应地如此之快，又是什么，给予了他们保持运动的能量。\n但是他们还是得活下去。\n消沉并没有作用，反而是助长着那些天选之子们的实力。悲愤，也是一种力量。\n与此相比，某人这一次的沉眠，实在是太舒适了。\n","date":"2023年5月3日","img":"","lang":"zh-hans","langName":"简体中文","largeImg":"","permalink":"/docs/%E6%9C%AB%E4%B8%96%E4%B8%8E%E5%85%BD%E5%90%8C%E8%A1%8C/%E7%AC%AC%E4%BA%8C%E7%AB%A0/","series":[{"title":"小说","url":"/series/%E5%B0%8F%E8%AF%B4/"}],"smallImg":"","tags":[{"title":"兽人","url":"/tags/%E5%85%BD%E4%BA%BA/"}],"timestamp":1683080835,"title":"第二章 异变，交易"},{"authors":[{"title":"（要饭的）可怜大猫猫","url":"/authors/yfdkldmm/"}],"categories":[{"title":"笔记","url":"/categories/%E7%AC%94%E8%AE%B0/"}],"content":"记录一下MySQL的命令\nMySQL最基础的命令 show databases 查询所有数据库\nuse 数据库名 打开指定数据库\nshow tables (from 数据库名) 不加from就是查询当前数据库，加from就是查询指定数据库名\n创建表 create table 表名（ 列名 类型， 列名 类型， …… ）;\ndesc 表名 查看表结构\nselect version() 查看MySQL版本，或者在cmd界面输入mysql \u0026ndash;version或mysql \u0026ndash;V\n语法规范 每一行完整的语句后面都必须用;或者\\g结尾。语句都不区分大小写，但建议关键字大写，表名，列名小写。可以缩进，也可以注释，用#，\u0026ndash;或者/**/来注释文字\n查询，select关键词 基本格式 select 列名 from 表名; 列名等可用*来替代，直接查询所有。查询多个列名时，中间可用逗号隔开。可使用`列名`格式，将关键词标记为字段名。 列名，常量，函数都可以作为查询对象，查询多个时可用逗号隔开。查询常量时，列名就是常量或者表达式本身，显示的是结果。\n起别名 select 列名 (as) 别名 from 表名; as为可选，直接空一格输入别名也同样起效。当别名有关键词或空格，#等特殊字符，可以使用单双引号，如\u0026rsquo;别名\u0026rsquo;或\u0026quot;别名\u0026quot;这样的格式来标记，推荐使用双引号。\n去重 select distinct 列名 from 表名; 拼接 查询的同时，将两个列表的值拼接为一个值，则用concat()函数。\nselect concat(\u0026#34;列名\u0026#34;, \u0026#34;+\u0026#34;, \u0026#34;列名\u0026#34;) from 表名; concat函数内接收字符，使用逗号隔开。注意，如果其中有值为null，则所有结果全为null，处理方式为判空（如下）\n判空 使用ifnull()函数来判空\nselect ifnull(\u0026#34;含有null的列名\u0026#34;,\u0026#34;任意字符\u0026#34;) from 表名; 效果为，如果值为null，则替换为第二个字符，不是null则不替换。\n条件查询 条件运算符 \u0026gt;，\u0026lt;，=，!=，\u0026lt;\u0026gt;，\u0026gt;=，\u0026lt;=。\nselect a from tables where b\u0026gt;100; 代表，在tables表中，查询a列中所有b\u0026gt;100的值。\n逻辑运算符 \u0026amp;\u0026amp;（and），||（or），!（not）\n起连接条件表达式的作用。\n模糊查询 关键词有：like，between and，in，is null | is not null。\nlike 一般和通配符使用，用法如下\nselect * from a where b like \u0026#39;%c%\u0026#39;; 代表从a中查询所有，b列中任意一个字符含有字符c的结果。\nselect * from a where b like \u0026#39;__c_d%\u0026#39;; 代表从a中查询所有，b列中，第三个字符为c同时第五个字符为d的结果。\n当需要限定的字符中有_等需要转义的字符时，可用下面两种方法。\nselect * from a where b like \u0026#39;_\\_%\u0026#39;; select * from a where b like \u0026#39;_$_%\u0026#39; escape \u0026#39;$\u0026#39;; \\依旧可以作为转义使用。或者使用任意一个字符，示例为$，然后后面加上excape \u0026lsquo;$\u0026rsquo;，即可作为转义符使用。\nbetween and 作用等同于同一个条件的区间限定，如\u0026quot;a between 1 and 20\u0026quot;等同于\u0026quot;a \u0026gt;= 1 and a \u0026lt;= 20\u0026quot; 不能随便调换数值，\u0026ldquo;between\u0026quot;完全替代\u0026gt;=的含义，而\u0026quot;and\u0026quot;也就完全替代\u0026lt;=的含义\nin select * from a where b in (\u0026#39;c\u0026#39;,\u0026#39;d\u0026#39;,\u0026#39;e\u0026#39;); 代表从a中查询所有，b列中值为c，d，e中的其中一个的结果。 不能与like的通配符使用，因为in的逻辑是取用=的条件。\nis null | is not null =或\u0026lt;\u0026gt;不能用于判断是否为null值，此时就需要用is null或者is not null判断。 但是is不能用于普通的数值判断。\n额外补充 +号的作用 只有一个作用，就是运算符。\nselect 10+90; #作为运算符加算 select \u0026#39;10\u0026#39;+90; #如果有一方为字符，则将转换为数字进行运算 select \u0026#39;a\u0026#39;+90; #如果字符无法转换为数字，则值为0，并再加算 select null+90; #如果有一方为null，则结果为null 安全等于\u003c=\u003e 作用与=相同，但是可以判断null，也可以用于普通的数值判断。就相当于普通的=与is null的结合。\n","date":"2023年5月2日","img":"","lang":"zh-hans","langName":"简体中文","largeImg":"","permalink":"/blog/2023/05/mysql%E5%91%BD%E4%BB%A4%E4%B8%80/","series":[{"title":"blog","url":"/series/blog/"}],"smallImg":"","tags":[{"title":"MySQL","url":"/tags/mysql/"}],"timestamp":1683028036,"title":"MySQL命令（一）"},{"authors":[{"title":"（要饭的）可怜大猫猫","url":"/authors/yfdkldmm/"}],"categories":[{"title":"笔记","url":"/categories/%E7%AC%94%E8%AE%B0/"}],"content":"主要是在学习MySQL命令以前，还需要多了解的一些东西\nmy.ini配置文件 首先，my.ini文件就在你安装的根目录下，用txt或者notepad什么的打开就行，然后找到mysqld这一行（大致在67行），下面的就全是配置详情了。\nport 这个就是端口号，可以直接在这里改\nbasedir 这个是MySQL的安装路径\ndatadir 是MySQL数据存放的路径\ncharacter-set-server 修改编码\ndefault-storage-engine 数据库的存储引擎\nsql-mode 设置语法模式\nmax_connections 数据库的最大连接数\n小总结 内容非常少，也没有特别需要注意的，除了改了这些东西以后，要重新启动服务\nMySQL的登入登出 直接使用提供的命令行 安装好MySQL以后，在开始页面里面就会多出来一个类似cmd的东西，可以直接点开，会让你直接输入MySQL密码，输入以后就跟下图差不多\n再输入exit或者Ctrl+C，会直接关掉这个界面\n使用cmd等登入MySQL 上面的方法虽然可以登入，但是只能登入root用户，而cmd可以登入其他用户。 先以登入root用户为例\nmysql -h localhost -P 3306 -u root -p 输入以上内容以后，就会提示输入密码，跟上面的图类似。 对于这些参数\n-h，是代表主机\n-P（注意一定是大写），是代表端口号\n以上两个如果是直接连接本机，可省略\n-u，代表用户名\n-p（一定要加上，后面为空代表不默认传递），代表密码，可以直接在后面加入密码，但是屏幕上会显示密码\n总结 没多少东西，单纯作为一个小笔记\n","date":"2023年5月2日","img":"","lang":"zh-hans","langName":"简体中文","largeImg":"","permalink":"/blog/2023/05/%E6%AD%A3%E5%BC%8F%E4%BD%BF%E7%94%A8mysql%E5%89%8D%E7%9A%84%E4%B8%80%E4%BA%9B%E4%B8%9C%E8%A5%BF/","series":[{"title":"blog","url":"/series/blog/"}],"smallImg":"","tags":[{"title":"MySQL","url":"/tags/mysql/"}],"timestamp":1683011889,"title":"正式使用MySQL前的一些东西"},{"authors":[{"title":"（要饭的）可怜大猫猫","url":"/authors/yfdkldmm/"}],"categories":[{"title":"教程","url":"/categories/%E6%95%99%E7%A8%8B/"}],"content":"使用的MySQL版本是5.5，之前有安装过8.0（然后密码给忘了），下面就是，如何将MySQL8.0卸载，并且再重新装上5.5的过程\n卸载MySQL 首先是停掉MySQL服务，方法挺多的，比如管理员模式打开cmd，输入net stop 数据库名。其他的网上一搜就有（而且我本身，似乎就根本启动不了服务，所以不需要这一步）\n然后是从磁盘上面将MySQL8.0卸载，推荐用卸载软件或者系统自带的东西卸载。我用的是geek，国外的一个免费软件，挺好用的（也比不少国内的东西良心），卸载的同时也可以关注一下卸载目录，自己再去文件里找找有没有少删掉的东西。\n下一步，找注册表，win10可以直接左下角搜索，或者win+R运行regedit.exe，找到HKEY_LOCAL_MACHINE\\SYSTEM\\CurrentControlSet\\Services目录下的MySQL或者其他指定过的MySQL名，删除\n做完以后，cmd里也可以再试试mysqld remove命令，这样应该就算删除完了\n安装MySQL5.5 安装文件 打开安装包，一开始的界面我就不详细说了，一直到三选一的界面\n选择中间的Custom来自定义一下。进去以后，点下面的Browse选路径。选自定义主要就是为了这个，我个人之前按照默认路径安装，然后发现\u0026hellip;\u0026hellip;路径在powershell里根本cd不进去，所以就再删了一次然后重装，并且自己选了绝对不会冲突的路径（C:/MySQL_5.5/）\n配置文件 当安装好以后，安装界面最后会有一个launch，这个启动的exe就是用来配置的程序。如果没有启动，可以自己去bin目录下找，我这里的路径就是C:/MySQL_5.5/bin/MySQLInstanceConfig.exe\n然后在这里，推荐其实是先关掉程序，然后右键属性→兼容性，选择XP，再管理员启动。\n打开以后，点第一次next，会看到出现了两个选项，一个是5.5，一个是8.0的配置文件（虽然我本地都删了，但是不知道为什么还会有）\n这里5.5没有亮红，是因为我已经配置过了，正常来说是亮红的 选择好以后，如果不想仔细了解，可以全部默认直接跳过\n这里，最需要注意的就是port number，因为可能存在端口号被占用的情况，可以自己在cmd中运行\nnetstat -ano | findstr : 端口号 来检查是否被占用。被占用了就需要结束掉进程，或者换一个端口号。 再点一下next，来到下一个界面\n推荐是选择第三个，并且选择utf8（不是utf-8）\n再下一页，就是设置MySQL的名字以及是否加入系统变量。反正是推荐系统变量加入，然后MySQL的名字的话，就看个人要不要改\n再下一页，是设置密码的地方。密码一定要记住，密码一定要记住，密码一定要记住！\n要是密码忘了，改起来非常麻烦，要不然就是完全卸载再重装（本来想用8.0，但是来用5.5，就是因为，密码忘了！）\n另外的选项，都可以不选，不过可以把密码底下的那个小框框点上，是选择是否允许远程机来访问的。最底下的那个是创建用户，不是必需。\n最后点一次next，就是配置安装了\n直接点execute，上面四个点是来看进度的。如果卡在第一个点没动，根本没打勾，并且兼容性什么都弄好了，可以选择重启一下（我是这样解决的），然后第三四条错误的，具体可以看这个链接，给了挺多的解决办法\n我本人就是卡在第三条的start service，然后本地cmd能出来mysql服务，自己net start mysql的时候，无法访问，搞来搞去无非就是，再找找是不是文件没删干净，然后改了mysql安装的路径，还有就是mysqld remove命令在cmd运行一下，一直到mysql和mysqld都没有反应之后，再重新安装，就成功了\n总结 说实话，安装完了，我也是懵的，不敢保证方法一定有用\n","date":"2023年5月2日","img":"","lang":"zh-hans","langName":"简体中文","largeImg":"","permalink":"/blog/2023/05/mysql%E7%9A%84%E5%AE%89%E8%A3%85/","series":[{"title":"blog","url":"/series/blog/"}],"smallImg":"","tags":[{"title":"MySQL","url":"/tags/mysql/"}],"timestamp":1683007606,"title":"MySql的安装"},{"authors":[{"title":"（要饭的）可怜大猫猫","url":"/authors/yfdkldmm/"}],"categories":[{"title":"末世，与兽同行","url":"/categories/%E6%9C%AB%E4%B8%96%E4%B8%8E%E5%85%BD%E5%90%8C%E8%A1%8C/"}],"content":" 呜~\n身边传来呜噜呜噜的声音，还有从声源处，由身体传来的震动感。\n“没事，白影……”\n努力平静身体，右手轻抚着那个小脑袋，想传递过去安心的信息。\n这……已经是连续第几次，第几天了？\n不知道。这种事……\n多想想，还是会有吧……不过，重要吗？\n不知觉中，心跳恢复了。立即从床上直起身子，然后离开原位，并立即开大一旁风扇的风力。太潮湿了，不知道为什么，那个梦之后，总会是心跳跳得极快，床上完全被汗水浸湿。\n“唉。”不知名的状况，除了叹气，也没什么能做的。\n呜~\n一直未离开手边的小家伙再一次刷着自己的存在感，还伸出舌头舔了舔。\n“好了，我可没牛奶……”很自然地说到一半。\n梦，都已经，影响到……\n深呼吸，把那诡异感，压下去。\n“来。”右手一捻，揪起小家伙的后颈皮，像猫一样，然后放到了怀里。\n它似乎很喜欢这个地方，翻滚一下，找个舒服的位置，就闭着眼睛，享受停不下来的抚摸了。\n不过……真的，好像啊……为什么，会和梦里的那个，那么像……？是因为，就是你么……\n思绪又在飘摇了，怀里家伙舔了一下，又将他给拉回来。\n“啊，饿了？”\n小家伙灵性地点了点头，像是，听得懂一样。\n放下那些着实很令人迷惑的想法，起身去给小家伙准备早餐。\n“还是一点罐头加上一点狗粮吧。”\n准备好后，白影立即吃了起来。\n“白影……”禁不住，又去想，而白影听到，立即停下转过头，“啊，没事。继续吧。”\n不能再想了。\n是的，真的不能再想了，他已经没有时间。今天即便是周六，他也还是得去上课。自从上了高中以后，双休就一直是单休了。\n几乎日复一日的生活，唯有每天的题在变化，每天的手机上是新的内容，晚上和某个人一路回家时聊的话语，还有，家里的白影，这些才让他感受到，日期是在流逝着。\n“啊，又来。”手机上突然出现的报道影响了他，迅速划去，也在这点时间里，看到了报道开头：\n昨日新增326名晶体生长者……\n“无聊。”这类报道，他向来毫不在意。没有影响他，与他的生活毫无关系的，一律懒得花心思。\n就连，晶体生长者是指那些醒来，突然发现身体某个部位长出了一小点晶块一样的东西的人这个说法，也是从其他人口中得知的。包括接下来的各类消息，如：这类人群已在全世界各地产生，且每日剧增，类似爆发性传染病一样，但是晶体生长者本身无任何异常，而且晶石虽然扣不掉，但是不会有痛感，也很小粒，几乎影响不到任何正常生活，所以并没有按照传染病的规模对待，只是不断进行着探究。这些，也都是从别人那里，道听途说来的。\n他不在乎，完全不在乎。或者，内心会有中二的想法，想要这个晶石作为身体上的一个特殊，与众不同的标记。不过，只是想想。中二的人，这种想法还很少吗？\n白天的课，很快没了，下午，由于不用上晚自习，他可以早点回去陪白影了。\n一想到白影，脸上就浮出笑容，很淡，但是存在，没有任何牵强。\n打开家门，白影直接就向他扑了过来。它早就在门口等着了，而已经过了这么久，早已记住的他，也是很顺畅地接住了，抱在怀里。\n“每天都这样。要是以后你长大了，还这样，我可是抱不起了。”白影看起来有点像萨摩耶，不过至少应该算是狼犬一类吧，直立尖耳是很明显的特征。当然，狼的话……\n“不过，你都三个月了，怎么感觉完全没有长啊。”白影依旧是三个月前，他捡到它的样子。\n哦，说捡或许……不适合。总之，挺……奇妙的，何曾会想到，自己门口突然蹲了个幼崽，还一见到你就直接扑过来的那种，甩都甩不掉。这个……没人会经历吧？回想起来，都感觉是梦来着。\n“算了，长不长无所谓了，小一点的话，吃得也少。”虽说经济暂时不成问题。\n进房间前，在门口，看了眼左边，紧闭的房间门，看不清里面任何样子。\n深呼吸一次，进了右边昏暗的房间。这才是他的房间。\n“明天，又有一天休息了。”但是没有喜悦，心里没有在想任何事，但是觉得应该想一些事的。\n无所适从。\n卸下破旧的书包，随便放在某个地方，打开风扇，坐在床边，而后又躺下。白影倒是一直都在怀里，闭着双眼，像是又睡着了。\n白影从一开始就是这样，几乎每时每刻都在睡觉，还总是喜欢缠着他睡觉，不闹腾，省了很多事。\n不过有时候……还是希望更活泼一下。太冷清了。\n像是察觉到他的想法，白影醒了，抬起它的眼皮，露出像是被血染红的眼眸，然后……\n“你咬我？！”\n毫不在意某个人的惊喊，又迅速咬住另一边伸过来的手，然后立即逃离，还在地上停了会儿，像是专门给某人追击时间。\n但是他不想追。好饿。中午又没怎么好好吃饭。\n白影又回来了，舔了舔他的脸。\n“一会儿，去散步？”\n小家伙高兴地甩了甩一直垂下的尾巴。\n……\n“诶，怎么突然感觉要下雨了？”\n出门时，顺便看了看窗外，已经从正午的大太阳转变为灰蒙蒙的颜色。\n这不会有阻扰，下雨天散步并不是没有做过，还没有打伞。白影的话，到时候可以抱在怀里，也还可以随时就回来。\n许久没出来见过开阔视野的小家伙很是兴奋，刚到楼底，就没影了。\n不需要任何担心，白影绝对不会自己出事的，反倒是偶尔还会从某些想不到的角落被它吓一吓。\n戴上蓝牙耳机，让熟悉了很久很久的节奏充斥大脑，逐渐地，感觉与世界脱离。\n梦……如此真实的梦，真实到触感，都忘不掉的梦……\n“以科学角度讲，是平行世界么……算了，反正没可能的。”\n想，要着改变，厌倦了，这一切。只有一丁点可能，都行吧，摆脱这些就好了吧……有可能的话……\n不需要可能了，已经，就在你眼前。\n谁？！\n不知名的声音让他停下脚步。此时，他才发现，已经走到了一个人烟稀少，但是很喜爱的小街道。\n因为很少会有人，所以，这里发生了什么，一般不会有任何人知道。\n周围的环境还是一如既往地熟悉，只不过，他记得，现在应该还属于傍晚，但此刻，却已经是黑幕笼罩。\n忍不住想拿出手机确认，或者看一看手上的表也行，不过，它们已经消失了，连同戴好的耳机。\n立即警惕着周围。他不惊乱，尽管有点慌，有点恐惧。\n“白影。”小声呼唤着，他相信，如果白影就在周围的话，它能听见的。\n小家伙很快出现，看起来神情没有变化，还主动跳上来，舔舔他的脸颊，像是在安慰。\n动物的直觉和感知都比人类强。那么，或许……\n“没什么事，是吗？”\n白影点了点头，然后跳下去，回头看了他一眼，小爪子一挥，很明显示意他跟上去。\n如此，灵性么……\n尽管叫他跟上去，但没有立即行动，心中还是保留着戒备，同时，也出现了一些好奇。带着这些，他还是决定，小心地跟上去。\n景色没有什么变化，依旧是他熟悉的那样，随后，他站在了已经坐下的白影的旁边。\n滴滴滴……\n突如其来的暴雨，连一点过渡都没有，就这样倾盆盖脸。\n快回去！\n又是不知道哪来的声音，但是没有精力去思考，因为声音消失后，他发现，自己突然踉跄了一步，然后大脑无比地昏沉，感觉特别无力，大雨，也仿佛在加重着负担。\n走回去几乎不可能了，不过好在，鲜有人来的地出现了个车，他打车回家了。不过，至于最后付没付钱，在哪下的，怎么上楼开门的，甚至是，白影有没有一起，他都记不起来。只是想着：\n快点到床上睡一觉。\n……\n雨，让所有人都不知所措。所有人，包含全世界，没有一个地方没有下这场雨。而且如果有人还有闲心观察的话，捧起一滩水，会发现，这雨，是黑色的。\n但他们可能会有闲心吗？\n并不单纯指遭遇大雨的繁忙。没准儿，你会在路上突然没了意识，哪怕你是在行走，跑步，还是在开车。不用担心任何后事，你也没法担心你的任何事了。\n另外，那些还有着意识的人，愿都能够及时发现异常，并赶快逃往人群稀疏的地方，那样还有的后续。\n还有，某些幸运儿们，如果突然觉得力大无穷，或者健步如飞，亦或获得了只存在幻想的能力，那就请拿好你的武器——考虑到情况，可以是街边的一个细长坚硬物，或者分量足够的重物，再不济，菜刀水果刀也行。\n总之，准备好吧，为了，活下去。\n","date":"2023年5月1日","img":"","lang":"zh-hans","langName":"简体中文","largeImg":"","permalink":"/docs/%E6%9C%AB%E4%B8%96%E4%B8%8E%E5%85%BD%E5%90%8C%E8%A1%8C/%E7%AC%AC%E4%B8%80%E7%AB%A0/","series":[{"title":"小说","url":"/series/%E5%B0%8F%E8%AF%B4/"}],"smallImg":"","tags":[{"title":"兽人","url":"/tags/%E5%85%BD%E4%BA%BA/"}],"timestamp":1682945359,"title":"第一章 过于，平淡"},{"authors":[{"title":"（要饭的）可怜大猫猫","url":"/authors/yfdkldmm/"}],"categories":[{"title":"末世，与兽同行","url":"/categories/%E6%9C%AB%E4%B8%96%E4%B8%8E%E5%85%BD%E5%90%8C%E8%A1%8C/"}],"content":" “真是刺眼的阳光……”\n又是这里……\n“早知道，少穿一点出来的。啊，也不行，已经是剩下的唯一一点防护了，孤零零的一个魔法师，还是保护好自己……”\n又是这句话……\n那么，接下来，我应该就会在这个希彼尔森林里，捡到……\n“嗯？那是……”\n果不其然，又是它……\n眼见之处，难得的一个空地，白花花的一个生物，显得格外刺眼。\n“这是……狼崽子？白色的？南方的希彼尔森林……有这种魔兽吗？”\n不知道，我甚至连这是什么世界都不知道。不过，接下来，它该醒了。\n“诶？”\n狼崽子醒了，然后一口咬住到旁边想要拨弄它的那根手指。基本没有任何力气。\n“是……饿了？”\n看样子，只是刚出生没多久，不过……完全不对劲。\n“虽然不知道……还是赶紧走，一会儿狼群来了，我肯定就死了。”\n不过狼崽不放过他，看似没力气，但是咬得很紧。不想太用力，但是没办法。\n摆脱纠缠后，狼崽颤巍巍地站起来，眼睛睁开了一条小缝，想要追上来，但它不可能追上已经迈开步的人类。\n现在，就应该看到那个了吧，唉，情节都能背了。\n没走几步，在之前还没有来得及观察的地方，看到了一些，森林的日常。\n脚步就这么停了下来。需要点时间思考，但不需要太多。\n“呵，所以，我这是……”回头，看着嗅着他气味缓慢跟过来的小家伙，“碰巧就……被迫接盘了？”\n可以不管的，但是，这是个小毛孩啊……遇见，就是缘分吧。\n蹲下身，轻轻抱起小家伙。狼崽立即再次咬住指头。\n“看样子，应该饿得不行了……真是难为你，不过，毕竟你的父母……还好戒指里有点牛奶……”经过不知道多少次的改良，空间戒指已经可以方便地从指定的地方放出里面的物品。\n狼崽喝了点牛奶，像是满足了，放开了手指，然后沉沉睡去。\n怀中，能够清晰地，感受到随着微弱的呼吸而微微震动。\n“就当，养了个小毛孩？反正这希彼尔森林里的狼，也不会是什么高级魔兽吧。虽说目前生活……诶，也就一狼崽，能吃多少。”抱着小家伙，一边往森林外走，一边自言自语着，“今天估计没法完成那个任务了，不过也没时间限制。嗯，貌似，也还得取个名？那，取什么？”\n低头看了看。与周围环境很是突兀的白色皮毛，偶尔稍稍抖动的小尖耳。\n“嗯，虽说是在西方这边逮着你的，不过还是取我那个地方的名字吧。白色毛……狼……嗯，那就白影吧。”\n画面突然归于虚无，唯有白影两个字，不停地在脑中循环。\n他知道，这个梦，到头了。他也知道，该醒了。\n猛地睁开双眼，几乎和闹钟同步。\n心脏莫名地跳得很快，喘着粗气，关掉闹钟，然后继续躺回已经被汗水浸湿的原位置。\n他不想动，他也，动不了，急促的心跳让他感觉，血液像在翻滚沸腾。\n难受。\n大脑已经放弃思考的他，只能在痛苦中，感受到一个生物的接近。\n“白……白影么。”\n","date":"2023年5月1日","img":"","lang":"zh-hans","langName":"简体中文","largeImg":"","permalink":"/docs/%E6%9C%AB%E4%B8%96%E4%B8%8E%E5%85%BD%E5%90%8C%E8%A1%8C/%E6%A5%94%E5%AD%90/","series":[{"title":"小说","url":"/series/%E5%B0%8F%E8%AF%B4/"}],"smallImg":"","tags":[{"title":"兽人","url":"/tags/%E5%85%BD%E4%BA%BA/"}],"timestamp":1682920078,"title":"楔子"},{"authors":[{"title":"（要饭的）可怜大猫猫","url":"/authors/yfdkldmm/"}],"categories":[{"title":"额外内容","url":"/categories/%E9%A2%9D%E5%A4%96%E5%86%85%E5%AE%B9/"}],"content":"主要是因为想要自定义一下网站，然后找了一个朋友帮（zhi）忙（jiao），得到的一些经验。 先丢两个压缩图片的网址：1和2，两个分别有不同的压缩率。2比1文件大小更小，但是同时也更模糊\n直接进行一个复制粘贴再改动 这部分是一个进阶的自定义改法，我也都不是很会，多亏朋友我才稍微有那么一点点眉目。主要原理，是hugo给出的覆盖原则，优先使用本地对应目录下的文件，其次再去找主题预设好的样式。\n权重修改 而我因为是想\u0026hellip;\u0026hellip;将docs里面的排布，从权重由小到大的往前排列（也就是直接反转网站默认的权重排列顺序），解决办法就是朋友去主题源码上面复制粘贴文件下来，再对代码进行修改，然后hugo逻辑复写。 对于我的这个需求，就是在主题仓库上，找到\u0026quot;\\layouts\\partials\\docs\\nav.html\u0026quot;这个文件，然后进行一个复制粘贴到本地对应的位置，也就是根目录\\layouts\\partials\\docs\\nav.html，对应着在20行左右的地方，将{{- $pages := sort (where $section.Pages \u0026quot;Params.navWeight\u0026quot; \u0026quot;\u0026gt;\u0026quot; 0) \u0026quot;Params.navWeight\u0026quot; \u0026quot;desc\u0026quot; -}}修改为{{- $pages := sort (where $section.Pages \u0026quot;Params.navWeight\u0026quot; \u0026quot;\u0026gt;\u0026quot; 0) \u0026quot;Params.navWeight\u0026quot; \u0026quot;asc\u0026quot; -}}就解决了 实际其实就只是改了最后的那一个参数，desc变为asc\ndiv生成顺序 根据此方法，我又去找了对应的一个文件，是\\layouts\\partials\\sidebar\\main.html文件，而我想做的，其实只是调节div的生成顺序，让blog详情里面的目录，在作者详情上方生成。 现在要做的，就是在浏览器上用开发者工具，去找到目录对应的类名，然后到main.html中对比，最后调节位置就可以了\n粘性小工具sticky 那么我为什么想要调节div顺序呢？还是因为这可以跟着网页动的作者小工具很Cooooooool诶！ 通过添加css的position: sticky，可以让对应的div跟着网页滑动一起移动，指南其实也有给具体实现方法， 但，是！ 他只给了profile的分块，如果我想让右边3个一起跟着动呢？ 第一个方法就是，按照他的步骤（前俩步骤都可以不要，逻辑是单独生成一个div，然后再去复写profile这个类名，使其被生成的div给捕捉，实际可以直接进行scss的复写。），对三个部件都添加相同的参数。 然后你就会发现\u0026hellip;\u0026hellip;粘是粘住了，但是布局就会\u0026hellip;\u0026hellip;\n因为sticky是根据top以及其他另外三个方向参数来决定黏着位置的，如果是简单地设置为三个div，且top为一致，就会出现挤在一块。或者就算自己去计算边距，然后给每个top都设置好，也会出现类似上图的样子。 对于这个问题，能想到一个非常简单的解决办法：直接把那一整块都给sticky不就完了？ 所以，就尝试给上一层父级进行复写定义。但是很快就出现了问题，单纯地按照他给的模板，将.profile改为.container，没有任何效果，并且即使做任何别的修改，也无济于事。 在尝试N久以后，最后是朋友帮我解决的。 因为container是已经定义了flex，直接复写position: sticky是没有任何作用的，只能按下面办法写：\n.sidebar { .container { align-self: flex-start; position: sticky; top: 84px; } } 加入align-self: felx-start，才有效。这是朋友确定了sticky本身不会有问题，只可能出现在flex上，然后网上搜，搜出来这个链接，里面有大佬回答才解决了这个问题。 感谢他们\n小工具附带问题 尽管通过上面方法将问题解决了，但是出现了新的问题，就是他的sidebar和container，其实几乎是所有页面右边作者小工具都使用同一个文件来定义的，也就是上面说到的\\layouts\\partials\\sidebar\\main.html文件。这本来是没有问题的，但是当我们将container整个定义sticky以后，就会发现点开blog，页面滑动的时候，右边一整块都在动，而目录就被压在底下根本看不到！ 那我这目录还有什么用呢？ 然后再看一眼div结构，会发现，新的目录跟profile并列，也无法再次拆分什么的。 那么解决办法，我就只想到了，要么直接把目录移到上面去（就如上面所说的做法），要么就是，没有目录时，对container进行sticky，有目录时，只对目录进行sticky，main.html也有类似if的写法检测目录是否生成，但是必须得对他的html写法进行一个了解，所以暂时\u0026hellip;\u0026hellip;我就只用了第一个方法（这个也有弊端，目录特别长的话，是不能放全目录的）\ndocs文件名 在整理docs那里面的文件，并打算上传我的小说的时候，发现怎么也不能和他默认模板那样，形成列表什么的，结果就自己研究了一下午，最后找出了问题。 最大的原因就是，他那文件名从index变成了_index，只有文件名作为_index，才能让其检测该目录下的其他文件夹\n总结 一些小知识也不知道会不会用到，所以单独放出来，以后也会不定时更新一下，只要我对我的网站进行了新的重要改动的话\n","date":"2023年5月1日","img":"","lang":"zh-hans","langName":"简体中文","largeImg":"","permalink":"/blog/2023/05/%E7%BD%91%E7%AB%99%E9%A1%B5%E9%9D%A2%E5%B8%83%E5%B1%80%E7%9A%84%E6%96%B0%E9%97%AE%E9%A2%98/","series":[{"title":"blog","url":"/series/blog/"}],"smallImg":"","tags":[{"title":"Hugo","url":"/tags/hugo/"}],"timestamp":1682912889,"title":"网站页面布局的新问题"},{"authors":[],"categories":[{"title":"前言","url":"/categories/%E5%89%8D%E8%A8%80/"}],"content":"目前本人有两本小说，简介如下\n末世，与兽同行 一个不那么标准的srk小说，主角团五人组，四个兽，其余全是人。世界观背景为基于现实的末世背景（也不是那么很末世）。小说企鹅群：1040182543\n关于幼年神的那些事 现代中世纪魔幻主题小说（非srk），主角总数为六。世界观背景为完全架空的西欧中世纪时代（但也可能会更先进一点点）\n","date":"2023年4月30日","img":"","lang":"zh-hans","langName":"简体中文","largeImg":"","permalink":"/docs/%E5%89%8D%E8%A8%80/","series":[{"title":"小说","url":"/series/%E5%B0%8F%E8%AF%B4/"}],"smallImg":"","tags":[{"title":"README","url":"/tags/readme/"}],"timestamp":1682826520,"title":"前言"},{"authors":[{"title":"（要饭的）可怜大猫猫","url":"/authors/yfdkldmm/"}],"categories":[],"content":"这里是由（要饭的）可怜大猫猫自己搭建的网站，用于分享本人（或者以后也有别的人）发布的包括但不限于： blog，小说，midi，小知识等东西。\n更多详情，请（务必）点击右方“关于我” 暂不支持英文界面，请谅解~（以后有空再说吧）\n","date":"2023年4月29日","img":"https://4AleRoL4.github.io/images/index.png","lang":"zh-hans","langName":"简体中文","largeImg":"","permalink":"/blog/2023/04/readme/","series":[{"title":"blog","url":"/series/blog/"}],"smallImg":"","tags":[{"title":"README","url":"/tags/readme/"}],"timestamp":1682783145,"title":"README"},{"authors":[{"title":"（要饭的）可怜大猫猫","url":"/authors/yfdkldmm/"}],"categories":[{"title":"教程","url":"/categories/%E6%95%99%E7%A8%8B/"}],"content":"前言 这部分会非常碎片，因为每一个要更改的部分，基本都互不相关。然后又因为主题作者给的指南，是按照文件类型分类的，所以每一次的更改导致网页变化的位置是不一样的，可能会东一块西一块。最后我是一边根据文件顺序改好内容，一边来写文档的，所以一开始的顺序也会跟文件顺序同步，并且只会优先修改真正需要的，多余的参数等以后有空了才会尝试并补上（最后也许会整合一下，给个清单？）\n配置文件修改 配置总览 首先是整个配置文件的目录结构，和大体的作用。这一段内容在指南里面有，我就不再赘述。需要关注的一个总览是站点配置，这里面有大致的配置文件内容，方便导航。 另外一点就是，可以使用hugo server一下，这样方便你更改了配置文件或其他东西以后实时查看更改内容，通过这一点，你其实也可以自己一点一点改文件，然后摸索什么文件具体管什么内容的（就是真的很麻烦）\nauthor.yaml 是作者小工具的配置，我就直接给出更改以后的效果吧\n可以看出来，author.yml文件差不多就是更改这个地方的东西。界面的变化，可以自己根据给出的图片对照着自己原本的模板查看，再下面也就讲解一下比较特殊一点的。 company和location，这俩因为个人原因，我没改。要说的点就是，后面的注释给了可以使用链接，格式也给出了，想设置的可以自己设置。 中间有一行about被注释了，但是在网页中依然有。当被注释时，会有一个默认值，跳转到默认已有的about页面下。你依旧可以自己设置链接跳转。 params\u0026hellip;\u0026hellip;只有一个参数，将#去掉然后保存就可以自己看到效果了，如下\n（我是不喜欢这个布局） 最后是social，可以看到我的twitter和paypal不在了，取而代之的是qq和bilibili。这部分是可以根据需求自己增删的，对应的表在社交链接里可以查看，或者看我下面的对应表。\n参数 平台 email 电子邮箱 facebook facebook个人地址 facebookgroup facebook群组地址 github github地址 gitlab gitlab地址 instagram Instagram个人地址 itchio itch.io个人地址 quora quora个人地址 stackoverflow StackOverflow个人地址 tumblr tumblr个人地址 twitter twitter个人地址 weibo 微博个人地址 zhihu 知乎个人地址 reddit reddit个人地址 telegram 电报个人地址 qq 个人QQ号 docker docker hub个人地址 bitbucket bitbucket workspace个人地址 kaggle kaggle个人地址 medium Medium 用户名或自定义域名（比如：https://yfd.kldmm.icu） lastfm last.fm个人地址 bilibili B站个人地址 youtube YouTube个人地址 discord discord邀请码 discourse 论坛地址 tiktok 抖音个人地址 pinterest Pinterest个人地址 mastodon mastodon个人地址 liberapay liberapay个人地址 paypal PayPal个人地址 tipeee tipeee个人地址 rss 空字符串禁用RSS链接 website 网站地址 patreon 红P个人地址 总共有这么一大长串的链接，（而且还可能漏了一些，因为我就发现指南里面，漏了红P的）。实际上也基本用不到这么多，很多网站对于国内来说，并不流通，对此，你也可以试着将不需要的删了。\nconfig.yaml 这个是一个比较核心的配置文件，里面有些东西要是一不小心修改，就会\u0026hellip;\u0026hellip;所以建议随时准备回档。同时，这个每一项的更改导致界面结果，是完全分散的，就没法一个图囊括。\nbaseURL 这个应该没有必要修改（我也没找出来具体有什么用）\ntitle 直接上图\n主要体现在，你头顶浏览器显示的内容，以及你blog页面最下面一排白色的字\ntheme 这个是加载主题，所给的url是指向主题原仓库，不能更改（你可以自己试试）\ncopyright 其实就是显示在blog页面最下面的那一行灰色的字，代表许可，就不单独给出图片查看了\ndefaultContentLanguage 就是设置页面的默认语言。下面给出一个图，可对应查询\n其中，简体中文需要使用zh-hans，使用zh-cn会报错，应该是后来改了\nhasCJKLanguage 注释中说明了如果包含后面几个语言，就需要把这个的注释取消掉。\n再往后的几个配置，暂且来说应该是没有必要的，先跳过吧。\nconfig.zh-hans.yaml 这个就是对应中文的config配置，里面也只有两个东西，不讲了\nlanguages.yaml 默认的有两个模板，一个是en，另一个是中文。并且是可以自己再添加语言上去的，按照他的模板来就可以。不过，英语+中文，对一般人来说足够了，就保持这样也差不多\nmenu.en.yaml and menu.zh-hans.yaml 这俩很明显是一对，所以一起讲。 点进去会发现，其实参数完全一致，并且只有一个，对应的就是网站最上方那一排\n文档的那一个按钮。默认给的跳转链接是主题作者的，你可以将其名字以及url改成自己的（暂时没想法，也可以直接将url删除或者填写自己网站的url，这样是跳转自己网站的主页面）\nparams.yaml 这是一个重头戏了，点开一看，里面一大堆的东西，还有一堆的注释，看起来就头疼。我这里也不可能把每一个对应的东西都说完，顶多后续更新会慢慢补充。 mainSections 这个内容，体现在主页面中央，可以自己删了试试。具体参数除了默认三个以外，还有，notes\nbrand 这个参数修改的就是左上角那一串文字，很明显，不给图了\npinnedPost 这个是控制是否允许置顶文章的，在其下面一行的count参数，就是最多置顶文章数\ngiscus and utterances 在一开始的教程中有说，如果想要开启评论区评论并且与github关联的话，就需要将这两个其中一个开启。 首先是这俩里面的参数repo，填写自己网站的仓库名。然后giscus的上面有一个链接，指向giscus的使用教程，有简体中文，而且只有三步，点几下就完了，所以也不再说了\nreward 这个就是给网站添加赞助小工具的配置。给了图片位置，也就是网站根目录\\images\\reward\\图片名，自己放进去吧\ntopAppBar 底下有一个很熟悉的，social列表，跟上面配置的一样，social链接，可自主增删改\n这里面还有非常多的参数，但是可能一开始还用不上，所以跳转到下一个吧\nserver.yaml 这个文件里，看起来似乎跟自主化没有太大关联，下一个吧~\nsocial.yaml 好了，最后一个了。 这个是最底下的一排一排的那些社交链接，跟之前设置的一样，不需要的删了，需要的自己改链接即可 （想自己添加别的社交链接来着，但是\u0026hellip;\u0026hellip;还根本看不懂这该如何添加，以后再说吧）\n相关图片的修改 文字什么的，还有部件什么的，都差不多改完了，但是图片还是他默认的，这可也得改了。 首先是最上方浏览器左边的小图标，这个的目录是在根目录\\assets里面，名为favicon.webp的文件，可以选择自己想要的图片直接覆盖，或者重命名为favicon.png也可以，但是webp优先级大于png，总之，替换了准没错。 其次是，根目录\\static\\images里面的两个文件，和之前一样改成同名文件即可，最后记得去根目录\\resources\\_gen\\images下面，删一下原本有的图片就可以了，记得要清理浏览器缓存，要不然图片是看不到更改的。\n文章位置以及对应参数 改完上面的，那么基本的上下左右什么的东西，都算是属于自己的内容了。但是中间的部分，一个blog最重要的部分，就是文章，这部分的话，又是一个大块内容。 首先，在根目录\\content\\文件夹里面，放着好几个文件夹，这些文件夹就是存放每一个文档的位置，不过有些文件夹并不需要动（也最好别动） 接着，我们来细细看一下每一个文件内容（暂时不做改动），整个目录如下所示\n其中，需要关注的，就是about，authors，blog，docs，news这几个文件夹。分别点进去看，都能看到有，要么是index文档，要么是文件夹+文档，文件夹里面还有文档。 看完了大致目录以后，可以都点开md文档来看看，包括其他没有说到的文件夹，也可以尝试自己改改，看看有什么变化，只是另外几个变化不如这几个来得直接。 顺带一提，这些文档命名里面大致可以看出来，是用文件夹名来区分，然后md文档名统一为\u0026rsquo;index.md\u0026rsquo;（英文文档）或者\u0026rsquo;index.zh-hans.md\u0026rsquo;（中文简体文档），指南给出的生成示例，也是如此。 接下来就分文件夹来讲讲吧\nabout 这个是之前在配置中，有个“关于我”的位置的一个文档，就在作者小工具那边，点一下就会跳转到about目录下的一个md文档，那么现在就可以在那里面改写正文内容了。\nauthors 这个是基于网站默认的可以根据作者进行分类的功能而专门分出来的一个文件夹，具体进入位置是在右边作者小工具下面作者里面，将里面的md文档改成自己的，还有图片也改成自己的就行。 另外支持额外创建文件夹来说明其他的作者（不过这样子，不算多吧？）\ndocs, news, blog 这些都是作为主要创作内容的文件夹，我们创作的md文档就是根据需要放在这里面的。 先说说news吧，点进去以后，有两个文档，一个文件夹。这两个文档，其实是关于网页上方那一排字，可以自己改改title看看，包括docs和blog也是这样。 接下来看文件夹。首先文件夹的命名，和网站上的一个文章一致，点进去发现只有index，通过改一改md文档内容，可以发现很多新的参数，这些参数基本都是通用的。 顺带一提，HBS主题支持根据标题等级给出序号，并给出目录跳转，所以如果需要写序号的话，直接使用标题就可以了，还能多一个界面跳转\nfeatured 判断是否为精选文章，在右边作者小工具下面\ndraft 判断是否为草稿，默认的hugo和hugo server都是不包含构建草稿的，养成好习惯，准备发布了就把draft改成false，要不然就自己加-D参数（到时候把所有的草稿全都发布上去喽）\ncomment 就是用来判断是否开启评论功能的。\ntoc 判断是否开启目录，在点进去文章详情以后的右边。目录分类是根据几级标题的，如上所说。\nreward 是用来判断是否开启赞助，上面在params中也有说。这个体现在点进文章以后，屏幕下方会有一个浮动小窗口，里面就有赞助的按钮。不过没有预设图，需要我们自己把我们的图片放进去。具体使用就在上面，仔细看的人是不会错过的。\npinned 这个是用来判断是否置顶，而最多置顶的数目，也在params中设置。\ncarousel 这个是判断是否加入顶部滚动播放，可以自己打开多个文件，分别修改为true或者false来看看效果，很明显的 注意，如果启用这个，那么就不要在文章使用二级标题，会出现很奇怪的错误，至少hugo server上面是这样。包括排版也是需要额外注意（所以应该只适合拿来给README等纯介绍性的文档使用了吧）\nseries，categories，tags，authors 这几个都是对文章进行分类的，当你按照格式对此进行修改时，就会发现打的标签什么的，就会多出来。对应的，在右边作者小工具下边，那一排的分类什么的，也会将标签提供上去（不过，需要重新hugo server一下，要不然你点标签是跳转不过去的）\nimages 这个标签是将所给的图片地址的图片，放进文章里，而且似乎只接受一个文件。当为空时，则默认使用该文档下的同路径里的图片，图片名不检索（至于多个图片会怎么选取\u0026hellip;\u0026hellip;自己试试吧），如果提供路径，则是优先使用给的路径图片。 顺便说一下图片路径，默认的图片路径根目录，是在网站根目录的static文件夹里。\n例如我这里的路径，那么对应的路径就该填写\u0026lt;/images/文件名\u0026gt;\n只不过有一个怪的地方就是，我用news目录下的默认md文档测试，但是用blog下的readme文档，就无法检测，只能使用路径，具体原因不明。\n总共常用的标签就是这些，这些搞定了，那么最基础的部分，都学会了，后面的都是一些别的内容了，下一个blog再见\n总结 这个主题给的功能很多，所以导致设置等东西，都要花很久。不过艰苦的设置以后换来的，就是满意的（其实也还有一点点不满意），一个属于自己的网站，踏出这一步以后，后面的都会变得简单许多（真的吗？）\n","date":"2023年4月29日","img":"https://4AleRoL4.github.io/images/%E5%BC%80%E5%A7%8B%E8%AE%A9%E7%BD%91%E7%AB%99%E5%8F%98%E6%88%90%E8%87%AA%E5%B7%B1%E6%83%B3%E8%A6%81%E7%9A%84%E6%A0%B7%E5%AD%90%E5%90%A7/index.png","lang":"zh-hans","langName":"简体中文","largeImg":"","permalink":"/blog/2023/04/%E5%BC%80%E5%A7%8B%E8%AE%A9%E7%BD%91%E7%AB%99%E5%8F%98%E6%88%90%E8%87%AA%E5%B7%B1%E6%83%B3%E8%A6%81%E7%9A%84%E6%A0%B7%E5%AD%90%E5%90%A7/","series":[{"title":"blog","url":"/series/blog/"}],"smallImg":"","tags":[{"title":"Hugo","url":"/tags/hugo/"}],"timestamp":1682780805,"title":"开始让网站变成自己想要的样子吧"},{"authors":[],"categories":[],"content":" 会写代码，btsrk，会做ff14的midi，会玩一丢丢类型非常杂的游戏，但不喜欢一些主流游戏，会写小说，仅此而已 代码教学一般都在博客中，请自行查阅。也欢迎找我私信，但我没空回复的话，也请见谅 ff14猪区，ID：影l风。不定期召集大猫们在旅人合奏，B站会同步更新合奏实录 小说就在网站中，等我约到稿子了就B站也放一份，小说企鹅群：1040182543 顺便丢个midishow链接，本人所做的midi会放在midishow上，如有需要其他格式，欢迎在B站私信。为了节省时间，可以在打招呼以后，说明需求的文件格式，以及传输方式 以上内容全部免费，如果在其他地方支付金钱，本人概不负责。另外，由于是用爱发电，所以也请尊重一下我的成果，在您没有人身攻击以前，我也会心平气和地与您交流 在此单独感谢一位群友，没有他的帮助，也不会有这个网站 但是如果有余力，可以赞赏一下嘛~ ","date":"2023年4月28日","img":"","lang":"zh-hans","langName":"简体中文","largeImg":"","permalink":"/about/","series":[],"smallImg":"","tags":[],"timestamp":1682640000,"title":"关于我"},{"authors":[{"title":"（要饭的）可怜大猫猫","url":"/authors/yfdkldmm/"}],"categories":[{"title":"教程","url":"/categories/%E6%95%99%E7%A8%8B/"}],"content":"首先确立blog框架 我使用的是Hugo框架来搭建blog，需要安装Go语言以及Git。\n安装步骤 首先Hugo有自带的安装步骤，按照那上面一步一步来。 我先是选择了Build from source，从源代码搭建（然后失败，留档视为耻辱，我正确安装的方式在第三条）。 安装Go，然后添加环境变量，最后打开cmd，输入以下代码\ngo version 出现下图类似的版本编号，即Go环境变量配置完成\n之后返回Hugo，按照步骤该执行以下代码\ngo install -tags extended github.com/gohugoio/hugo@latest 我出现了如下错误\n之后再在下面打一行\ngo env -w GOPROXY=https://goproxy.cn 之后再次输入上面的代码，之后冒出来一大串，等待安装完成就行\n直接使用包管理工具安装 hugo是给了三个办法，我选择了Scoop 在安装Scoop前，需要PowerShell，正好hugo运行也需要PowerShell，所以就直接安装了吧，直通地址，然后在PowerShell中输入\nSet-ExecutionPolicy -ExecutionPolicy RemoteSigned -Scope CurrentUser 再输入\nirm get.scoop.sh | iex 因为网络问题，可能会出现图下状况\n我自己是因为网络，无法连接，重复执行一两次以后，就成功了\n之后再根据hugo给的代码，通过scoop安装hugo\nscoop install hugo-extended 安装完成就如下图\n最后打一行代码看看是否真的成功\n创建本地网站（本大标题废弃，留作耻辱，真正部署成功步骤在下一个标题） 首先，在Hugo教程步骤上明确说明，不要使用cmd，也不要使用Windows PowerShell，而是要PowerShell（和Windows PowerShell是两回事），看到这肯定已经安装好了\n在powershell中cd到你要安装的目录下，开始按照网站给的代码一行一行输入\nhugo new site quickstart cd quickstart git init git submodule add https://github.com/theNewDynamic/gohugo-theme-ananke themes/ananke echo \u0026#34;theme = \u0026#39;ananke\u0026#39;\u0026#34; \u0026gt;\u0026gt; config.toml hugo server 一行一行地输入后，没有任何报错，就会有下图\n在第二行能找到localhost:端口号，将这串网站在自己浏览器打开，就会有一个默认的blog界面\n很普通，但至少说明网站框架有了。接下来按Ctrl+C停止服务，以便于后续的更改。\n开始正式增加blog 尽管界面还很简略，但是已经可以作为一个blog开始发布md文档，那下面就是一些基础的操作 先别管别的，直接执行下面的代码\nhugo new posts/my-first-post.md 然后，下一行代码\nhugo service -D 当你再次去查看网页并刷新时，就会发现多出个内容\n那么很显然，这就是我们刚刚使用默认模板直接创建的一个md文档，并且网站实时更新出来了。 既然到了这一步，就可以开始正式开始尝试将我们自己的md文档放在网站上了。\nmd文档放在哪 首先根据我之前按照给出的命令行执行的内容，以及我自己更改的目录结构，最后我的blog网站项目是在D:\\blog\\quickstart的目录下，以后要启动项目，也得先cd到这个目录下才行。 接着，自己打开目录，会发现里面有很多的文件夹。 别的暂且不用管，专注于content文件夹，点进去，会有posts文件夹，再点进去，就会发现我们之前默认生成的一个md文档，文件名为：my-first-posts。 所以很明显，md文档放在主目录/content/posts/目录下，就会被网站识别上传（也许会有别的办法更改目录什么的，总之先这样好了）\n编写md文档 呃，首先是想确认一下，如果你真的md文档什么都不会的话，可以点这里，然后看着那教程来编写，需要用到的也不多，就是标题，正文，代码块，列表，链接，图片，这些就足够了，同时推荐vsc的一个小插件，名叫Markdown Preview Enhanced，这个可以在vsc中编写md文档并且实时预览，安装好以后在md文档里面右键，在菜单栏下面找到MPE:打开侧边预览，或者快捷键，先Ctrl+K，再按下V md文档基础相关就到这，接下来是hugo相关的基础东西 首先打开生成的默认模板\n可以发现与普通md文档不同的是，没有一级标题，取而代之是\u0026mdash;括起来的一块区域。 在这一块当中，就是hugo给出的一个默认的front matter，分别是三个属性（而且还有更多参数），具体内容可以自己查阅hugo网站，我就直接以实用方式开说了。\ntitle title顾名思义，就是标题，在这里的作用，其实就是替代了一级标题，所以不需要我们自己再去创建一级标题，正文直接从二级标题开始即可。同时，这个一级标题也会体现在blog总览界面，所以功能比一级标题多一点\ndate date就是blog的发布日期，具体写哪天，可以自己琢磨，格式也就是YYYY-MM-DDTHH:MM:SSZ（标准的RFC 3339格式），通俗点就是，直接使用UTC时间来标注\ndraft draft（草稿），其值只有true或false（或者直接删除）。在生成静态网页的时候，如果是不带任何参数的hugo service，那么在本地预览的时候，是会忽略掉拥有draft=true的md文档的。而在后面加了-D参数，表示也要将标记为draft（草稿）的md文档加入预览中。具体如何使用这个参数，就自己去思考吧。 同时，和draft作用相似的，还有date（当设置的时间为未来时），publishDate（当设置的时间为未来时），expiryDate（当设置的时间为过去时），这三个以后再说。 总之就是，要么发布时记得把draft删掉或false，要么就是启动的时候加上\u0026ndash;buildDrafts参数\n发布网站 上面都做好了，那么就该最后一步了，将网站发布出去。 首先，按照步骤，需要去根目录中找到config.toml，来编辑一些东西\nbaseURL里面就填写你的地址，如果还没有在github pages里面配置域名的话，那这个地方就是填写的是待会儿在github pages那个仓库的名字。languageCode就是语言+国家缩写，title的话，其实就是默认页面上面，那一排大大的字。最后的theme明显就是网站的那个主题模板，在正式开始美化前，先暂时不管吧 然后呢，就是去github创建仓库，并且命名为username.github.io，username就是你github的名字，比如我github名为4AleRoL4，那么就该写\u0026quot;4AleRoL4.github.io\u0026quot;，创建过程中要不要创建md文件看个人。 创建好以后，点setting→pages，然后build and deployment下，source选择github actions，那么在github上的配置就完成了。最后是记得去Code→绿色图标的code那边，将local下的https地址复制一下，后面使用git会用。 之后就是按着hugo教程来（因为我在使用这个方法的时候失败了，怎么也解决不了气得我第二天直接换了一个底子，部署和配置什么的，都不一样，所以这边就没法说的很详细）。 遇到的问题可以稍微说一下，教程中所说的创建.github/workflows/什么的.yaml文件，应该是创建在hugo server的目录下，而不是在hugo以后出现的public文件夹内，上传的时候是在quickstart目录下，进行上传。或者说\u0026hellip;\u0026hellip;请~，这篇blog写得还不错，我没说到的细节也可以在这里得到补充，只可惜我跟ta的步骤几乎颠倒，也没办法再回头，索性不如，全部重头来\n重新开始 这部分我觉得，应该没有多少参考性了，因为我使用的theme的安装方式有点奇特，是从github直接复制工程下来，再自己更改好以后上传到自己的仓库里，不需要hugo new site，也不需要自己创建yaml东西，所以跟前面的步骤，相当于是跨了很大一截（然后出现更奇怪的错误），作为记录，我还是稍微记一下\n克隆文件 先贴一下我使用的HBS主站，然后在下方的介绍界面会找到，或者直接点击HBS新手模板，在这个github页面下，就是我们需要复制下来的仓库。 在这个页面下的md文档也有说如何操作，我就稍微讲一讲。 第一步，自己创建以\u0026quot;username.github.io\u0026quot;命名的仓库，username替换为自己的github名字，我这里就是4AleRoL4。默认选项里的话，可以选择不添加md文档（反正最后是要改的），我是添加了md文档。 创建好以后，就可以回到本地，然后输入\ngit clone https://github.com/razonyang/hugo-theme-bootstrap-skeleton.git blog 里面的参数blog其实就是接下来你的项目文件名，这里我就取了yfdkldmm-blog。 之后再按照下面3行依次每行执行\ncd yfdkldmm-blog rm -rf .git git init -b main 一定要小心rm -rf .git这行命令，请确保cd到对应目录下才开始输入 接下来就可以看到一大串文件\n更改配置并第一次提交 之后是更改go.mod文件内容，第一行的\nmodule github.com/razonyang/hugo-theme-bootstrap-skeleton 将其地址改为自己的仓库地址\nmodule github.com/4AleRoL4/4AleRoL4.github.io 更改完以后，就可以提交到远程仓库，查看是否部署成功 但在此之前，请\nhugo 一下，输入这一行代码以后，会将你的网页打包成静态网页，并放入public文件夹中。每次在部署前，在本地修改了内容，就记得hugo一下之后，再开始上传，后面就不会再赘述了。 另外提一下，hugo以后，同样可以进入public文件夹中查看网页，只不过这时要用到别的东西，之后再说。 继续部署的配置吧。 首先，需要设置远程仓库连接（请将我的链接替换为自己仓库的链接，就在code→绿色的code里面）\ngit remote add origin https://github.com/4AleRoL4/4AleRoL4.github.io.git 建立好连接以后，请一定记住，在提交远程仓库前，要先pull一下，与远程仓库同步一下，特别是创建仓库的时候设置了默认md文档的，如果不执行pull，就会无法继续下一步。首先，是需要本地提交一下\ngit add . git commit -m \u0026#34;First commit\u0026#34; 接着就是pull\ngit pull --rebase origin main 此时，你打开你的README.md文档，可能会发现多了些\u0026raquo;\u0026raquo;\u0026raquo;\u0026gt;，\u0026laquo;\u0026laquo;\u0026laquo;这样的符号，如果了解git的，就知道这是需要处理的分支冲突，解决办法就是，将这些非常明显的字符全部删掉，并且留下你希望上传的内容，保存，接着继续输入以下内容\ngit rebase --continue 之后，可能还需要再本地提交一次，最后是输入\ngit push origin main 运行成功，刷新自己的github仓库，就会看到有很多东西上传上来了。 但是上面的部分，我不确定是否真的需要，因为我初次使用的时候，是用到了，但我没截图。当我再次更改README.md文件，并且提交上去时，却没有这部分步骤，改好文档，commit提交，pull下来直接push就完了，所以给不了什么具体截图\n总之，要是有问题，尝试自己解决一下吧 最后，提交上去以后，回到github仓库，setting→Pages→Build and deployment→Source这里，应该使用默认的Deploy from a branch，同时在下面Branch，选择gh-pages，后面一个文件夹选/(root)，最后save一下，如下图\n之后，网站应该就会自主部署了，详细信息可在Action里面查看\n输入自己的域名，我的就是\u0026quot;4AleRoL4.github.io\u0026quot;，就可以访问了（只不过界面可能\u0026hellip;\u0026hellip;不尽人意）\n正确加载主题 如果点我的页面，和你自己的界面的话，会有非常大的差距，这是因为并没有完全配置好。在入门模板里面也还有着后续的操作需要去完成。 会出现大量空白，并且排布很乱的情况，这就是因为主题并没有成功加载到网页上，还需要在本地执行\nnpm i hugo mod get github.com/razonyang/hugo-theme-bootstrap@master hugo mod npm pack npm update git add go.mod go.sum package.json package-lock.json git commit -m \u0026#39;Update the theme\u0026#39; 这一长串的代码（小提醒，go.mod里面的东西记得改哦），除此之外，你还需要去网站根目录下的/.github/workflows/gh-pages.yml的文件里面，大概第42行左右那里\n- name: Build run: hugo --minify --gc --enableGitInfo -b https://projects.razonyang.com/hugo-theme-bootstrap-skeleton/ 在这一长串，将包含-b以及后面的东西全删了（原教程只说了-b，但我没找到，踩了一次坑，实际就是，网页还是那种缺东西的样子）。 总之，这些都搞好了，那么再一次提交到远程库上面，等运行完以后，再次点击，那么网站主题应该就彻底弄好了。 而这也说明，你的网站也就搭建成功！（不过只是有个骨架，核心的还得慢慢搞呢）\n额外内容 关于gh-pages.yml文件的一些内容说明 这个其实是一位群友给我小编辑一下的图（而他也是从头指导我搭建好这个网站的人，感激之情无以表达），下面就放一放那个图\n域名配置 真的不会觉得\u0026quot;username.github.io\u0026quot;这个域名作为自己专属的blog域名，很俗吗？ 那肯定必须得改！ 首先第一步就是，得去买一个域名，自己百度一下阿里云或者腾讯云的域名购买，去那边买一个就好，或者有能力的可以选择\u0026quot;www.name.com\u0026quot;去购买。我是腾讯云买的。 其次对域名小说明一下，对于我个人的blog域名yfd.kldmm.icu这个域名，要买的其实是kldmm.icu，而yfd.是子域名，自己设置就好。然后价格，最通用的.com域名一直都非常贵，而别的不流通的.icu啊.top什么的，就会很便宜（另外，真的有人会用中文域名嘛？），其次跟你要买的长度有关，yfdkldmm.net和kldmm.net两个也是一个价格差，总之自己挑选吧 购买好以后，需要进入域名配置，大概就是这个界面\n点击你自己购买的域名，进入\n我这边已经配置过了，正常情况是空的，需要自己点添加记录开始添加。图我就不放了，只需要记住：\n主机记录写@代表空子域名，填写什么就是什么的子域名。 我这里是使用CNAME方式，记录值就是你的\u0026quot;username.github.io\u0026quot;，都设置好了，这边就结束了 接着再回到github页面，在你网站的根目录下，创建一个名为CNAME的文件，内容为你的域名\n最后，再去setting→pages设置你的自定义域名就可以了。参考来源，不过这里面的方法是说记录值为IP，我本人尝试以后是报错，说请使用CNAME方式跳转\n关于hugo以后的预览 执行hugo打包以后，所有的东西会被打包进public文件夹中，在里面你可以找到非常多的html文件，但是你无法直接打开，直接打开的话就会是各种奇奇怪怪的页面。这个时候就需要用到http-server。 首先可以通过node.js安装\nnpm install --global http-server 安装好以后，就可以使用\nhttp-server [path] [option] 来预览打包以后的网页。path填写你的public文件夹路径，要么是绝对路径，要么是相对路径，以目前就在网站根目录下为例，path就是./public。option是可选，在这个链接有详细说明，不过一般空着就行\n另外就是\u0026hellip;\u0026hellip;我本人的电脑似乎无法成功安装，显示安装成功后依旧无法使用。幸好还有免安装的办法\nnpx http-server [path] [option] 通过这个方法，可以直接运行，不需要安装，我也是通过这个才实现了预览。\n运行出来，可以看到端口号是8080，那么通过localhost:8080就可以访问了。\n一些小问题 本来没有这个板块的，但是某一天我起来突然发现hugo server报错了，那就顺便记录一下。\n错误提示就在上面，Error：Cannot find module autoprefixer 上网一查，或者仔细看那些给出的目录下，大致也能猜到autoprefixer是一个nodejs里面的模块。之前没有出问题，但是突然冒出来可能是因为\u0026hellip;\u0026hellip;我改了npm的global模块位置。 解决办法也很简单\nnpm install autoprefixer npm install autoprefixer -g 这两行都运行一下，就能解决了\n总结 至此，作为一个单纯的网站搭建以及部署，就完成了。虽然这个网站的东西基本都不是你自己的，但至少，域名是我们自己的，已经可以给朋友炫耀一下下了。然后下一次blog，就是关于如何将这个网站，彻底变为自己的东西的相关资料\n","date":"2023年4月27日","img":"https://4AleRoL4.github.io/images/blog%E6%90%AD%E5%BB%BA%E5%8F%8A%E9%97%AE%E9%A2%98/index.jpg","lang":"zh-hans","langName":"简体中文","largeImg":"","permalink":"/blog/2023/04/blog%E6%90%AD%E5%BB%BA%E5%8F%8A%E9%97%AE%E9%A2%98/","series":[{"title":"blog","url":"/series/blog/"}],"smallImg":"","tags":[{"title":"Hugo","url":"/tags/hugo/"}],"timestamp":1682558400,"title":"Blog搭建及问题"},{"authors":[],"categories":[],"content":"","date":"1年1月1日","img":"","lang":"zh-hans","langName":"简体中文","largeImg":"","permalink":"/offline/","series":[],"smallImg":"","tags":[],"timestamp":-62135596800,"title":"Offline"},{"authors":[],"categories":[],"content":"","date":"1年1月1日","img":"","lang":"zh-hans","langName":"简体中文","largeImg":"","permalink":"/contact/","series":[],"smallImg":"","tags":[],"timestamp":-62135596800,"title":"联系我们"}]
